linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>CWSELREI3</name>
          <description>Channel Analog Watchdog Select For External inputs</description>
          <addressOffset>0x2DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WSEL_SI3_24</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI3_25</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI3_26</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI3_27</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI3_28</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI3_29</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI3_30</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI3_31</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CWENR0</name>
          <description>Channel Watchdog Enable For Precision Inputs</description>
          <addressOffset>0x2E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CWEN0</name>
              <description>Channel Analog Watchdog Enable 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nowd</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enwd</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWEN1</name>
              <description>Channel Analog Watchdog Enable 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nowd</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enwd</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWEN2</name>
              <description>Channel Analog Watchdog Enable 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nowd</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enwd</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWEN3</name>
              <description>Channel Analog Watchdog Enable 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nowd</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enwd</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWEN4</name>
              <description>Channel Analog Watchdog Enable 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nowd</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enwd</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWEN5</name>
              <description>Channel Analog Watchdog Enable 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nowd</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enwd</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWEN6</name>
              <description>Channel Analog Watchdog Enable 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nowd</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enwd</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CWEN7</name>
              <description>Channel Analog Watchdog Enable 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nowd</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enwd</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
