linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>CALBISTREG</name>
          <description>Control And Calibration Status</description>
          <addressOffset>0x3A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000070</resetValue>
          <resetMask>0xFFFFC0FF</resetMask>
          <fields>
            <field>
              <name>TEST_EN</name>
              <description>Calibration Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nocal</name>
                  <description>Wait to start a calibration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>runcal</name>
                  <description>Start calibration</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST_FAIL</name>
              <description>Calibration Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>CALPASS_YES</name>
                  <description>Calibration finished successfully or has not been run since the last reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALPASS_NO</name>
                  <description>Calibration did not finish successfully</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVG_EN</name>
              <description>Calibration Averaging Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>discalavg</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>calav</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NR_SMPL</name>
              <description>Calibration Averaging Number</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lowest</name>
                  <description>4 samples</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>low</name>
                  <description>8 samples</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>16 samples</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>highest</name>
                  <description>32 samples</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALSTFUL</name>
              <description>Calibration And Self-Test Full Range Comparison</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>reducedsar</name>
                  <description>Lowest 11 bits are compared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fullsar</name>
                  <description>All 15 bits are compared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>C_T_BUSY</name>
              <description>Calibration Busy</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>waitcal</name>
                  <description>Calibration can be started</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>runcal</name>
                  <description>Calibration is in progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMP</name>
              <description>Sample Period In Calibration</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>22 conversion clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lowest</name>
                  <description>8 conversion clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>low</name>
                  <description>16 conversion clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>highest</name>
                  <description>32 conversion clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESN</name>
              <description>Conversion Resolution</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>high</name>
                  <description>14-bit resolution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mid</name>
                  <description>12-bit resolution</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>low</name>
                  <description>10-bit resolution</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lowest</name>
                  <description>8-bit resolution</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OFSGNUSR</name>
          <description>Offset And Gain User</description>
          <addressOffset>0x3A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OFFSET_USER</name>
              <description>Offset User</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GAIN_USER</name>
              <description>Gain User</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL2</name>
          <description>Calibration Value 2</description>
          <addressOffset>0x3B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x43008243</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENX</name>
              <description>Enable X</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disclpx</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enclpx</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
