linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>CIMR1</name>
          <description>EOC Interrupt Enable For Standard Inputs</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIEOCIEN0</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN1</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN2</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN3</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN4</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN5</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN6</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN7</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN8</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN9</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN10</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN11</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN12</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN13</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN14</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN15</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN16</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN17</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN18</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN19</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN20</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN21</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN22</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIEOCIEN23</name>
              <description>Standard Input EOC Interrupt Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nosieoci</name>
                  <description>Interrupt is not flagged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sieociset</name>
                  <description>Interrupt is flagged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
