linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>WTISR</name>
          <description>Analog Watchdog Threshold Interrupt Status</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>LAWIF1</name>
              <description>Low Analog Watchdog Interrupt Flag 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF1</name>
              <description>High Analog Watchdog Interrupt Flag 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF2</name>
              <description>Low Analog Watchdog Interrupt Flag 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF2</name>
              <description>High Analog Watchdog Interrupt Flag 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF3</name>
              <description>Low Analog Watchdog Interrupt Flag 3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF3</name>
              <description>High Analog Watchdog Interrupt Flag 3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF4</name>
              <description>Low Analog Watchdog Interrupt Flag 4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF4</name>
              <description>High Analog Watchdog Interrupt Flag 4</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF5</name>
              <description>Low Analog Watchdog Interrupt Flag 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF5</name>
              <description>High Analog Watchdog Interrupt Flag 5</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF6</name>
              <description>Low Analog Watchdog Interrupt Flag 6</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF6</name>
              <description>High Analog Watchdog Interrupt Flag 6</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF7</name>
              <description>Low Analog Watchdog Interrupt Flag 7</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF7</name>
              <description>High Analog Watchdog Interrupt Flag 7</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF8</name>
              <description>Low Analog Watchdog Interrupt Flag 8</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF8</name>
              <description>High Analog Watchdog Interrupt Flag 8</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF9</name>
              <description>Low Analog Watchdog Interrupt Flag 9</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF9</name>
              <description>High Analog Watchdog Interrupt Flag 9</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF10</name>
              <description>Low Analog Watchdog Interrupt Flag 10</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF10</name>
              <description>High Analog Watchdog Interrupt Flag 10</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF11</name>
              <description>Low Analog Watchdog Interrupt Flag 11</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF11</name>
              <description>High Analog Watchdog Interrupt Flag 11</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF12</name>
              <description>Low Analog Watchdog Interrupt Flag 12</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF12</name>
              <description>High Analog Watchdog Interrupt Flag 12</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified high threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGHER</name>
                  <description>Conversion result is higher than the specified high threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAWIF13</name>
              <description>Low Analog Watchdog Interrupt Flag 13</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>Conversion result is greater than the specified low threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWER</name>
                  <description>Conversion result is lower than the specified low threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAWIF13</name>
