linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <dim>24</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ICDR[%s]</name>
          <description>Standard Input n Conversion Data</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Conversion Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESULT</name>
              <description>Conversion Data Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncd</name>
                  <description>Normal trigger</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>jcd</name>
                  <description>Injected trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bctucd</name>
                  <description>BCTU trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERW</name>
              <description>Overwrite Status Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>noowr</name>
                  <description>No unread data is overwritten</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>owr</name>
                  <description>Unread data is overwritten</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Conversion Data Available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nodata</name>
                  <description>No unread conversion data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dataav</name>
                  <description>Unread conversion data is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CWSELRPI0</name>
          <description>Channel Analog Watchdog Select For Precision Inputs</description>
          <addressOffset>0x2B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WSEL_SI0_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI0_1</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI0_2</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI0_3</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI0_4</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI0_5</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI0_6</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI0_7</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CWSELRPI1</name>
          <description>Channel Analog Watchdog Select For Precision Inputs</description>
          <addressOffset>0x2B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CWSELRSI0</name>
          <description>Channel Analog Watchdog Select For Standard Inputs</description>
          <addressOffset>0x2C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WSEL_SI0_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI1_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI2_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI3_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI4_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI5_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI6_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI7_0</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
