linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>STCR2</name>
          <description>Self-Test Configuration 2</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMA_S</name>
              <description>Fault Mapping Algorithm S</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncf</name>
                  <description>Noncritical fault line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cf</name>
                  <description>Critical fault line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMA_C</name>
              <description>Fault Mapping Algorithm C</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncf</name>
                  <description>Noncritical fault line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cf</name>
                  <description>Critical fault line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMA_WDTERR</name>
              <description>Fault Mapping Self-Test Watchdog Timer Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncf</name>
                  <description>Noncritical fault line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cf</name>
                  <description>Critical fault line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMA_WDSERR</name>
              <description>Fault Mapping Self-Test Watchdog Sequence Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncf</name>
                  <description>Noncritical fault line</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cf</name>
                  <description>Critical fault line</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>Self-Test Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stdis</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sten</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKERR_S0</name>
              <description>Mask Error Interrupt Algorithm S0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idis</name>
                  <description>No interrupt is generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ien</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKERR_S1</name>
              <description>Mask Error Interrupt Algorithm S1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idis</name>
                  <description>No interrupt is generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ien</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKERR_S2</name>
              <description>Mask Error Interrupt Algorithm S2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idis</name>
                  <description>No interrupt is generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ien</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKERR_C</name>
              <description>Mask Error Interrupt Algorithm C</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idis</name>
                  <description>No interrupt is generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ien</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKWDG_EOA_S</name>
              <description>Mask Error Interrupt End Of Algorithm S</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idis</name>
                  <description>No interrupt is generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ien</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKWDG_EOA_C</name>
              <description>Mask Error Interrupt End Of Algorithm C</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idis</name>
                  <description>No interrupt is generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ien</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKST_EOC</name>
              <description>Mask Interrupt Self-Test End Of Conversion</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idis</name>
                  <description>No interrupt is generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ien</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKWDTERR</name>
              <description>Mask Interrupt Self-Test Watchdog Timer Error</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idis</name>
                  <description>No interrupt is generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ien</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SERR</name>
              <description>Self-Test Error Injection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>INJ_AVAIL</name>
                  <description>Error can be injected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INJ_NO</name>
                  <description>Error is being injected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSKWDSERR</name>
              <description>Mask Interrupt Self-Test Watchdog Sequence Error</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>idis</name>
                  <description>No interrupt is generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ien</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STCR3</name>
          <description>Self-Test Configuration 3</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSTEP</name>
              <description>Algorithm Step</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALG</name>
              <description>Algorithm Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBRR</name>
          <description>Self-Test Baud Rate</description>
          <addressOffset>0x34C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x50000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BR</name>
              <description>Baud Rate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>fastestbr</name>
                  <description>A step of the selected self-test algorithm is executed every time after the set of selected inputs has been converted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>slowestbr</name>
                  <description>A step of the selected self-test algorithm is executed after the set of selected inputs has been converted 256 times.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT</name>
              <description>Self-Test Watchdog Timer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>br0</name>
                  <description>8192 conversion clock cycles (~0.1 ms at 80 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>br1</name>
                  <description>39,936 conversion clock cycles (~0.5 ms at 80 MHz)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>br2</name>
                  <description>79,872 conversion clock cycles (~1 ms at 80 MHz)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>br3</name>
                  <description>159,744 conversion clock cycles (~2 ms at 80 MHz)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>br4</name>
                  <description>400,384 conversion clock cycles (~5 ms at 80 MHz)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>br5</name>
                  <description>799,744 conversion clock cycles (~10 ms at 80 MHz)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>br6</name>
                  <description>1,599,488 conversion clock cycles (~20 ms at 80 MHz)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>br7</name>
                  <description>3,999,744 conversion clock cycles (~50 ms at 80 MHz)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
