linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>PFCPGM_XPEADR_L</name>
          <description>Platform Flash Memory Express Program Erase Address Logical</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XPEADR_L</name>
              <description>Express Program Erase Address Logical</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCPGM_XPEADR_P</name>
          <description>Platform Flash Memory Express Program Erase Address Physical</description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XPEADR_P</name>
              <description>Express Program Erase Address Physical</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PFCBLK_SPELOCK[%s]</name>
          <description>Block n Sector Program Erase Lock</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLCK</name>
              <description>Sector Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCBLKU_SPELOCK</name>
          <description>Block UTEST Sector Program Erase Lock</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLCK</name>
              <description>Sector Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PFCBLK_SSPELOCK[%s]</name>
          <description>Block n Super Sector Program Erase Lock</description>
          <addressOffset>0x35C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSLCK</name>
              <description>Super Sector Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PFCBLK_SETSLOCK[%s]</name>
          <description>Block n Set Sector Lock</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETSLCK</name>
              <description>If the vector bit value = 0, the corresponding lock bit is not owned by any master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCBLKU_SETSLOCK</name>
          <description>Block UTEST Set Sector Lock</description>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETSLCK</name>
              <description>Set Sector Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PFCBLK_SSETSLOCK[%s]</name>
          <description>Block n Set Super Sector Lock</description>
          <addressOffset>0x39C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSETSLCK</name>
              <description>Set Super Sector Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>5</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>PFCBLKi_LOCKMASTER_S[%s]</name>
          <description>no description available</description>
          <addressOffset>0x3C0</addressOffset>
          <register>
            <dim>8</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PFCBLK_LOCKMASTER_S[%s]</name>
            <description>Block a Lock Master Sector b</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LOCKMASTER_S</name>
                <description>Block a Lock Master Sector b</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>PFCBLKU_LOCKMASTER_S</name>
          <description>Block UTEST Lock Master Sector</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCKMASTER_S</name>
              <description>Lock Master Sector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>PFCBLKi_LOCKMASTER_SS[%s]</name>
          <description>no description available</description>
          <addressOffset>0x484</addressOffset>
          <register>
            <dim>3</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2</dimIndex>
            <name>PFCBLK_LOCKMASTER_SS%s</name>
            <description>Block m Lock Master Super Sector n</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LOCKMASTER_SS</name>
                <description>Block a Lock Master Super Sector b</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
