linzhi813/ems_s32k/config/S32K344.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SIUL2</name>
      <description>SIUL2</description>
      <groupName>SIUL2</groupName>
      <baseAddress>0x40290000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x17B8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SIUL_0</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>SIUL_1</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>SIUL_2</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>SIUL_3</name>
        <value>56</value>
      </interrupt>
      <registers>
        <register>
          <name>MIDR1</name>
          <description>SIUL2 MCU ID Register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MINOR_MASK</name>
              <description>Minor Mask Revision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR_MASK</name>
              <description>Major Mask Revision</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PART_NO</name>
              <description>MCU Part Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRODUCT_LINE_LETTER</name>
              <description>Product Line Letter</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIDR2</name>
          <description>SIUL2 MCU ID Register 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>FLASH_SIZE_CODE</name>
              <description>Flash Size Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_SIZE_CODE_2</name>
                  <description>512kB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_SIZE_CODE_4</name>
                  <description>1MB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_SIZE_CODE_8</name>
                  <description>2.00MB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_SIZE_CODE_12</name>
                  <description>3.00MB</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_SIZE_CODE_16</name>
                  <description>4.00MB</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_SIZE_CODE_24</name>
                  <description>6.00MB</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_SIZE_CODE_32</name>
                  <description>8.00MB</description>
                  <value>0x20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_SIZE_DATA</name>
              <description>Flash Size Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_SIZE_DATA_0</name>
                  <description>64KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_SIZE_DATA_1</name>
                  <description>128KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_SIZE_DATA_2</name>
                  <description>256KB</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_DATA</name>
              <description>Flash Data</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_DATA_2</name>
                  <description>Monolithic</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_CODE</name>
              <description>Flash Code</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_CODE_2</name>
                  <description>Monolithic</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQUENCY</name>
              <description>Frequency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREQUENCY_3</name>
                  <description>120 MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQUENCY_4</name>
                  <description>160 MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQUENCY_5</name>
                  <description>240 MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PACKAGE</name>
              <description>Package</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PACKAGE_3</name>
                  <description>257-MAPBGA</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PACKAGE_35</name>
                  <description>100-MAXQFP</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PACKAGE_38</name>
                  <description>172-MAXQFP</description>
                  <value>0x26</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPERATURE</name>
              <description>Temperature</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEMPERATURE_4</name>
                  <description>M = 125C</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TECHNOLOGY</name>
              <description>Technology</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TECHNOLOGY_1</name>
                  <description>C40EFS3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
