linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>DISR0</name>
          <description>SIUL2 DMA/Interrupt Status Flag Register0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>EIF0</name>
              <description>External Interrupt Status Flag 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER0 and IFEER0 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF1</name>
              <description>External Interrupt Status Flag 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER1 and IFEER1 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF2</name>
              <description>External Interrupt Status Flag 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER2 and IFEER2 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF3</name>
              <description>External Interrupt Status Flag 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER3 and IFEER3 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF4</name>
              <description>External Interrupt Status Flag 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER4 and IFEER4 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF5</name>
              <description>External Interrupt Status Flag 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER5 and IFEER5 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF6</name>
              <description>External Interrupt Status Flag 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER6 and IFEER6 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF7</name>
              <description>External Interrupt Status Flag 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER7 and IFEER7 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF8</name>
              <description>External Interrupt Status Flag 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER8 and IFEER8 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF9</name>
              <description>External Interrupt Status Flag 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER9 and IFEER9 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF10</name>
              <description>External Interrupt Status Flag 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER10 and IFEER10 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF11</name>
              <description>External Interrupt Status Flag 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER11 and IFEER11 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF12</name>
              <description>External Interrupt Status Flag 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER12 and IFEER12 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF13</name>
              <description>External Interrupt Status Flag 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER13 and IFEER13 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF14</name>
              <description>External Interrupt Status Flag 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER14 and IFEER14 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF15</name>
              <description>External Interrupt Status Flag 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER15 and IFEER15 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF16</name>
              <description>External Interrupt Status Flag 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER16 and IFEER16 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF17</name>
              <description>External Interrupt Status Flag 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER17 and IFEER17 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF18</name>
              <description>External Interrupt Status Flag 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER18 and IFEER18 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF19</name>
              <description>External Interrupt Status Flag 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER19 and IFEER19 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF20</name>
              <description>External Interrupt Status Flag 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER20 and IFEER20 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF21</name>
              <description>External Interrupt Status Flag 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER21 and IFEER21 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF22</name>
              <description>External Interrupt Status Flag 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER22 and IFEER22 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF23</name>
              <description>External Interrupt Status Flag 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER23 and IFEER23 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF24</name>
              <description>External Interrupt Status Flag 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER24 and IFEER24 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF25</name>
              <description>External Interrupt Status Flag 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
                  <description>No interrupt event has occurred on the pad.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIF_YES</name>
                  <description>An interrupt event as defined by IREER25 and IFEER25 has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIF26</name>
              <description>External Interrupt Status Flag 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIF_NO</name>
