linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>GPDI113</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1572</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI112</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1573</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI119</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1574</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI118</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1575</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI117</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1576</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI116</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1577</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI123</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1578</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI122</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1579</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI121</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x157A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI120</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x157B</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI127</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x157C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI126</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x157D</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI125</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x157E</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI124</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x157F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI131</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1580</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI130</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1581</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI129</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1582</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI128</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1583</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI135</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1584</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI134</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1585</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI133</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1586</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
