linzhi813/ems_s32k/config/S32K344.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCM</name>
      <description>DCM</description>
      <groupName>DCM</groupName>
      <baseAddress>0x402AC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DCMSTAT</name>
          <description>DCM Status</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x171</resetValue>
          <resetMask>0xFFFFFDFF</resetMask>
          <fields>
            <field>
              <name>DCMDONE</name>
              <description>DCM Scanning Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMDONE_0</name>
                  <description>Running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMDONE_1</name>
                  <description>Completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMERR</name>
              <description>DCM completion with error status (valid only if DCMDONE bit is set)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMERR_0</name>
                  <description>DCM completed with success.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMERR_1</name>
                  <description>DCM completed with error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCST</name>
              <description>LC Scanning Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCST_0</name>
                  <description>Completed with errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCST_1</name>
                  <description>Completed successfully</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMUTS</name>
              <description>DCM Utest DCF Scanning Status (valid only if DCMDONE bit is set)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMUTS_0</name>
                  <description>DCM Utest DCF completed with errors.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMUTS_1</name>
                  <description>DCM Utest DCF completed successfully.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMOTAS</name>
              <description>DCM OTA Scanning Status (valid only when the value of the DCMDONE field is 1)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMOTAS_0</name>
                  <description>Completed with errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMOTAS_1</name>
                  <description>Completed successfully</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMDBGPS</name>
              <description>Debug Password Scanning Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMDBGPS_0</name>
                  <description>Completed with errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMDBGPS_1</name>
                  <description>Completed successfully</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMLCC</name>
          <description>LC and LC Control</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFF88</resetMask>
          <fields>
            <field>
              <name>DCMCLC</name>
              <description>Current LC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMCLC_0</name>
                  <description>FA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMCLC_1</name>
                  <description>Pre-FA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMCLC_2</name>
                  <description>OEM_PROD</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMCLC_3</name>
                  <description>CUST_DEL</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMCLC_6</name>
                  <description>MCU_PROD</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMCLC_7</name>
                  <description>IN_FIELD</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMLCFN</name>
              <description>Force LC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMLCFN_0</name>
                  <description>Normal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMLCFN_1</name>
                  <description>Forced on current LC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMRLC</name>
              <description>Real LC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMRLC_0</name>
                  <description>FA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMRLC_1</name>
                  <description>Pre-FA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMRLC_2</name>
                  <description>OEM_PROD</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMRLC_3</name>
                  <description>CUST_DEL</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMRLC_6</name>
                  <description>MCU_PROD</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMRLC_7</name>
                  <description>IN_FIELD</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCMFLC</name>
              <description>Force Next LC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCMFLC_0</name>
                  <description>No force</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMFLC_1</name>
                  <description>Force LC to one next</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCMFLC_2</name>
                  <description>Force LC to two next (only possible in CD)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
