linzhi813/ems_s32k/config/S32K344.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCM_GPR</name>
      <description>DCM_GPR</description>
      <alternatePeripheral>DCM</alternatePeripheral>
      <groupName>DCM_GPR</groupName>
      <baseAddress>0x402AC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DCMROD1</name>
          <description>Read Only GPR On Destructive Reset Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>PCU_ISO_STATUS</name>
              <description>PCU Input Isolation status on previous standby entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCU_ISO_STATUS_0</name>
                  <description>Input isolation did not get enabled in the previous standby entry.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCU_ISO_STATUS_1</name>
                  <description>Input isolation enabled in the previous standby entry.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_DCF_VIO</name>
              <description>DCF violation from HSE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE_DCF_VIO_0</name>
                  <description>No violation from HSE DCF records while decoding.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_DCF_VIO_1</name>
                  <description>Violation from HSE DCF records while decoding.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY_RESP_READY</name>
              <description>Key Response Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEY_RESP_READY_0</name>
                  <description>Key response is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY_RESP_READY_1</name>
                  <description>Key response is ready.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMROD3</name>
          <description>Read Only GPR On Destructive Reset Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>CM7_0_LOCKUP</name>
              <description>CM7_0 Core Lockup Status. Read this bit to identify the reason of fault in case of FCCU NCF 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_LOCKUP_0</name>
                  <description>CM7_0 core not in lockup state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_LOCKUP_1</name>
                  <description>CM7_0 core in lockup state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_LOCKUP</name>
              <description>HSE Core Lockup Status. Read this bit to identify the reason of fault in case of FCCU NCF 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE_LOCKUP_0</name>
                  <description>HSE core not in lockup state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_LOCKUP_1</name>
                  <description>HSE core in lockup state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_RCCU1_ALARM</name>
              <description>Cortex M7 Cores Lockstep Error Status. Read this bit to identify the reason of fault in case of FCCU NCF 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_RCCU1_ALARM_0</name>
                  <description>No lockstep alarm reported by RCCU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_RCCU1_ALARM_1</name>
                  <description>Lockstep alarm reported by RCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_RCCU2_ALARM</name>
              <description>Cortex M7 Cores Redundant Lockstep Error Status. Read this bit to identify the reason of fault in case of FCCU NCF 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_RCCU2_ALARM_0</name>
                  <description>No lockstep alarm reported by redundant RCCU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_RCCU2_ALARM_1</name>
                  <description>Lockstep alarm reported by redundant RCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCM_GSKT_ALARM</name>
              <description>TCM IAHB Gasket Monitor Alarm Status. Read this bit to identify the reason of fault in case of FCCU NCF 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCM_GSKT_ALARM_0</name>
                  <description>No alarm reported from TCM IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_GSKT_ALARM_1</name>
                  <description>Monitor alarm reported from TCM IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_SYS_GSKT_ALARM</name>
              <description>Status of IAHB gasket safety alarm from DMA system AXBS IHAB gasket</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_SYS_GSKT_ALARM_0</name>
                  <description>No safety alarm reported from DMA-system AXBS IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_SYS_GSKT_ALARM_1</name>
                  <description>Safety alarm indicated by DMA-system AXBS IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_PERIPH_GSKT_ALARM</name>
              <description>Status of IAHB gasket safety alarm from DMA periph AXBS IAHB gasket</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_PERIPH_GSKT_ALARM_0</name>
                  <description>No safety alarm reported from DMA-periph AXBS IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_PERIPH_GSKT_ALARM_1</name>
                  <description>Safety alarm indicated by DMA-periph AXBS IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYS_AXBS_ALARM</name>
              <description>System AXBS Safety Alarm Status. Read this bit to identify the reason of fault in case of FCCU NCF 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYS_AXBS_ALARM_0</name>
                  <description>No safety alarm indicated by system AXBS.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYS_AXBS_ALARM_1</name>
                  <description>Safety alarm indicated by system AXBS.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_AXBS_ALARM</name>
              <description>DMA AXBS_Lite Safety Alarm Status. Read this bit to identify the reason of fault in case of FCCU NCF 1.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_AXBS_ALARM_0</name>
                  <description>No safety alarm indicated by DMA AXBS_Lite.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_AXBS_ALARM_1</name>
                  <description>Safety alarm indicated by DMA AXBS_Lite.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_GSKT_ALARM</name>
              <description>HSE IAHB Gasket Alarm Status. Read this bit to identify the reason of fault in case of FCCU NCF 1.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE_GSKT_ALARM_0</name>
                  <description>No alarm indicated by HSE IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_GSKT_ALARM_1</name>
                  <description>Alarm indicated by HSE IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QSPI_GSKT_ALARM</name>
              <description>QSPI IAHB Gasket Alarm Status. Read this bit to identify the reason of fault in case of FCCU NCF 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QSPI_GSKT_ALARM_0</name>
                  <description>No alarm indicated by QSPI IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QSPI_GSKT_ALARM_1</name>
                  <description>Alarm indicated by QSPI IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIPS1_GSKT_ALARM</name>
              <description>AIPS1 IAHB Gasket Alarm Status. Read this bit to identify the reason of fault in case of FCCU NCF 1.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIPS1_GSKT_ALARM_0</name>
                  <description>No alarm indicated by AIPS1 IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIPS1_GSKT_ALARM_1</name>
                  <description>Alarm indicated by AIPS1 IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIPS2_GSKT_ALARM</name>
              <description>AIPS2 IAHB Gasket Alarm Status. Read this bit to identify the reason of fault in case of FCCU NCF 1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIPS2_GSKT_ALARM_0</name>
                  <description>No alarm indicated by AIPS2 IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIPS2_GSKT_ALARM_1</name>
                  <description>Alarm indicated by AIPS2 IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_EDC_ERR</name>
              <description>Status of integrity error on address for safety</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_EDC_ERR_0</name>
                  <description>No integrity error on address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_EDC_ERR_1</name>
                  <description>Address integrity error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_EDC_ERR</name>
              <description>Status of integrity error on data for safety</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_EDC_ERR_0</name>
                  <description>No integrity error on data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_EDC_ERR_1</name>
                  <description>Data integrity error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCM_AXBS_ALARM</name>
              <description>TCM AHB Splitter Safety Alarm Status. Read this bit to identify the reason of fault in case of FCCU NCF 1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCM_AXBS_ALARM_0</name>
                  <description>No safety alarm indicated by TCM AHB splitter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_AXBS_ALARM_1</name>
                  <description>Safety alarm indicated by TCM AHB splitter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_GSKT_ALARM</name>
              <description>EMAC IAHB Gasket Alarm Status. Read this bit to identify the reason of fault in case of FCCU NCF 1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_GSKT_ALARM_0</name>
                  <description>No alarm indicated by EMAC IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_GSKT_ALARM_1</name>
                  <description>Alarm indicated by EMAC IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH_AXBS_ALARM</name>
              <description>PERIPH AXBS_Lite Safety Alarm Status. Read this bit to identify the reason of fault in case of FCCU NCF 1.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_AXBS_ALARM_0</name>
                  <description>No safety alarm indicated by Periph AXBS_Lite.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_AXBS_ALARM_1</name>
                  <description>Safety alarm indicated by Periph AXBS_Lite.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LC_ERR</name>
              <description>Error in Lifecycle Scanning. Read this bit to identify the reason of fault in case of FCCU NCF 3.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LC_ERR_0</name>
                  <description>No error while lifecycle scanning.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LC_ERR_1</name>
                  <description>Error while lifecycle scanning.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRAM1_ECC_ERR</name>
              <description>Multi bit ECC error from SRAM1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRAM1_ECC_ERR_0</name>
                  <description>No multi-bit ECC error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRAM1_ECC_ERR_1</name>
                  <description>Multi-bit ECC error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRAM0_ECC_ERR</name>
              <description>Multi bit ECC error from SRAM0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRAM0_ECC_ERR_0</name>
                  <description>No multi-bit ECC error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRAM0_ECC_ERR_1</name>
                  <description>Multi-bit ECC error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_DCDATA_ECC_ERR</name>
              <description>Multi bit ECC error from CM7_0 DCache data memory</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
