linzhi813/ems_s32k/config/S32K344.svd
                  <description>No-go indication referring to the supply being unclean and a fault in double bond connection or its routing within the chip.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST_ACTIVATION_0_ERR</name>
              <description>Accidental Partial Test Activation. Read this bit to identify the reason of fault in case of FCCU NCF 5.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEST_ACTIVATION_0_ERR_0</name>
                  <description>No partial test activated accidentally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_ACTIVATION_0_ERR_1</name>
                  <description>Partial test activated accidentally.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST_ACTIVATION_1_ERR</name>
              <description>Accidental Partial Test Activation. Read this bit to identify the reason of fault in case of FCCU NCF 5.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEST_ACTIVATION_1_ERR_0</name>
                  <description>No partial test activated accidentally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_ACTIVATION_1_ERR_1</name>
                  <description>Partial test activated accidentally.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMROD5</name>
          <description>Read Only GPR On Destructive Reset Register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>INTM_0_ERR</name>
              <description>Interrupt monitor0 error reported by INTM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTM_0_ERR_0</name>
                  <description>No error reported by interrupt monitor 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTM_0_ERR_1</name>
                  <description>Error reported by interrupt monitor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTM_1_ERR</name>
              <description>Interrupt monitor1 error reported by INTM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTM_1_ERR_0</name>
                  <description>No error reported by interrupt monitor 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTM_1_ERR_1</name>
                  <description>Error reported by interrupt monitor 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTM_2_ERR</name>
              <description>Interrupt monitor2 error reported by INTM</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTM_2_ERR_0</name>
                  <description>No error reported by interrupt monitor 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTM_2_ERR_1</name>
                  <description>Error reported by interrupt monitor 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTM_3_ERR</name>
              <description>Interrupt monitor3 error reported by INTM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTM_3_ERR_0</name>
                  <description>No error reported by interrupt monitor 3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTM_3_ERR_1</name>
                  <description>Error reported by interrupt monitor 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_NCF_0</name>
              <description>Software NCF0 Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_NCF_0_0</name>
                  <description>Software NCF0, DCMRWF1[FCCU_SW_NCF0] not enabled by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_NCF_0_1</name>
                  <description>Software NCF0, DCMRWF1[FCCU_SW_NCF0] enabled by software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_NCF_1</name>
              <description>Software NCF1 Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_NCF_1_0</name>
                  <description>Software NCF1, DCMRWF1[FCCU_SW_NCF1] not enabled by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_NCF_1_1</name>
                  <description>Software NCF1, DCMRWF1[FCCU_SW_NCF1] enabled by software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_NCF_2</name>
              <description>Software NCF2 Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_NCF_2_0</name>
                  <description>Software NCF2, DCMRWF1[FCCU_SW_NCF2] not enabled by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_NCF_2_1</name>
                  <description>Software NCF2, DCMRWF1[FCCU_SW_NCF2] enabled by software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_NCF_3</name>
              <description>Software NCF3 Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_NCF_3_0</name>
                  <description>Software NCF3, DCMRWF1[FCCU_SW_NCF3] not enabled by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_NCF_3_1</name>
                  <description>Software NCF3, DCMRWF1[FCCU_SW_NCF3] enabled by software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STCU_NCF</name>
              <description>STCU non-critical fault, that is, BIST result error</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STCU_NCF_0</name>
                  <description>STCU non-critical fault not reported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STCU_NCF_1</name>
                  <description>STCU non-critical fault reported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBIST_ACTIVATION_ERR</name>
              <description>Indicates an accidental backdoor access on memories</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MBIST_ACTIVATION_ERR_0</name>
                  <description>No accidental backdoor enabled on memories.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBIST_ACTIVATION_ERR_1</name>
                  <description>Accidental backdoor enabled on memories.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STCU_BIST_USER_CF</name>
              <description>L/M BIST enabled accidentally</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STCU_BIST_USER_CF_0</name>
                  <description>No accidental L/M BIST enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STCU_BIST_USER_CF_1</name>
                  <description>Accidental L/M BIST enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTR_BUS_ERR</name>
              <description>Fault reported due to illegal access on MTR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTR_BUS_ERR_0</name>
                  <description>No transfer error indicated from MTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTR_BUS_ERR_1</name>
                  <description>Transfer error indicated from MTR.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG_ACTIVATION_ERR</name>
              <description>Monitoring of unintended debug activation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBUG_ACTIVATION_ERR_0</name>
                  <description>Unintended debug not activated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG_ACTIVATION_ERR_1</name>
                  <description>Unintended debug activated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCM_RDATA_EDC_ERR</name>
              <description>Integrity(EDC) error on TCM read data for safety</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCM_RDATA_EDC_ERR_0</name>
                  <description>No integrity error reported on TCM read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_RDATA_EDC_ERR_1</name>
                  <description>Integrity error reported on TCM read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_RDATA_EDC_ERR</name>
              <description>Integrity(EDC) error on EMAC read data for safety</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_RDATA_EDC_ERR_0</name>
                  <description>No integrity error reported on EMAC read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_RDATA_EDC_ERR_1</name>
                  <description>Integrity error reported on EMAC read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_RDATA_EDC_ERR</name>
              <description>Integrity(EDC) error on eDMA read data for safety</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_RDATA_EDC_ERR_0</name>
                  <description>No integrity error reported on eDMA read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_RDATA_EDC_ERR_1</name>
                  <description>Integrity error reported on eDMA read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_AHBP_RDATA_EDC_ERR</name>
              <description>Integrity error on CM7_0 peripheral read data for safety</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_AHBP_RDATA_EDC_ERR_0</name>
                  <description>No integrity error reported on CM7_0 peripheral read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_AHBP_RDATA_EDC_ERR_1</name>
                  <description>Integrity error reported on CM7_0 peripheral read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_AHBM_RDATA_EDC_ERR</name>
              <description>Integrity error on CM7_0 main read data for safety</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_AHBM_RDATA_EDC_ERR_0</name>
                  <description>No integrity error reported on CM7_0 main read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_AHBM_RDATA_EDC_ERR_1</name>
                  <description>Integrity error reported on CM7_0 main read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_RDATA_EDC_ERR</name>
              <description>Integrity (EDC) error on HSE read data for safety</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE_RDATA_EDC_ERR_0</name>
                  <description>No integrity error reported on HSE read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_RDATA_EDC_ERR_1</name>
                  <description>Integrity error reported on HSE read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMROF1</name>
          <description>Read Only GPR On Functional Reset Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>EMAC_MDC_CHID_0</name>
              <description>EMAC DMA Channel ID0 Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_MDC_CHID_0_0</name>
                  <description>Channel ID0 is not the current transfer channel ID.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_MDC_CHID_0_1</name>
                  <description>Channel ID0 is the current transfer channel ID.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_MDC_CHID_1</name>
              <description>EMAC DMA Channel ID1 Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_MDC_CHID_1_0</name>
                  <description>Channel ID1 is not the current transfer channel ID.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_MDC_CHID_1_1</name>
                  <description>Channel ID1 is the current transfer channel ID.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMROF2</name>
          <description>Read Only GPR On Functional Reset Register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>DCF_SDID0</name>
              <description>Configuration bits of DCF client SDID 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMROF3</name>
          <description>Read Only GPR On Functional Reset Register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>DCF_SDID1</name>
              <description>Configuration bits of DCF client SDID 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
