linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>DCMRWP1</name>
          <description>Read Write GPR On Power On Reset Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLKOUT_STANDBY</name>
              <description>Clockout standby expose over functional and destructive reset.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKOUT_STANDBY_0</name>
                  <description>The CLKOUT_STANDBY function is not available while functional or destructive reset on PTA12.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUT_STANDBY_1</name>
                  <description>The CLKOUT_STANDBY function is available while functional or destructive reset on PTA12.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STANBDY_PWDOG_DIS</name>
              <description>Disables the standby entry and exit monitoring window of the POR WDOG.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANBDY_PWDOG_DIS_0</name>
                  <description>Enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANBDY_PWDOG_DIS_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDOG_TRIM</name>
              <description>Trims for POR WDG timeout value.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWP3</name>
          <description>Read Write GPR On Power On Reset Register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEST_RST9_AS_IPI</name>
              <description>Configures a destructive reset to interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEST_RST9_AS_IPI_0</name>
                  <description>Destructive reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEST_RST9_AS_IPI_1</name>
                  <description>PLL LOL interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWD2</name>
          <description>Read Write GPR On Destructive Reset Register</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EOUT_STAT_DUR_STEST</name>
              <description>Controls the EOUT state during selftest.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EOUT_STAT_DUR_STEST_0</name>
                  <description>EOUT state will change to high Z post selftest when device is under reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOUT_STAT_DUR_STEST_1</name>
                  <description>EOUT state will remain in FAULT state until this bit is cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWD3</name>
          <description>Read Write GPR On Destructive Reset Register</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF4FFBFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CM7_0_LOCKUP_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 0 for the fault: CM7_0 core lockup.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_LOCKUP_EN_0</name>
                  <description>CM7_0 core not in lockup state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_LOCKUP_EN_1</name>
                  <description>CM7_0 core in lockup state.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_RCCU1_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 0 for the fault: Cortex M7 cores lockstep error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_RCCU1_ALARM_EN_0</name>
                  <description>No lockstep alarm reported by RCCU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_RCCU1_ALARM_EN_1</name>
                  <description>Lockstep alarm reported by RCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_RCCU2_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 0 for the fault: Cortex M7 cores redundant lockstep error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_RCCU2_ALARM_EN_0</name>
                  <description>No lockstep alarm reported by redundant RCCU.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_RCCU2_ALARM_EN_1</name>
                  <description>Lockstep alarm reported by redundant RCCU.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCM_GSKT_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: TCM IAHB Gasket monitor alarm</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCM_GSKT_ALARM_EN_0</name>
                  <description>No alarm reported from TCM IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_GSKT_ALARM_EN_1</name>
                  <description>Monitor alarm reported from TCM IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_SYS_GSKT_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: IAHB gasket safety alarm from DMA system AXBS IHAB gasket</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_SYS_GSKT_ALARM_EN_0</name>
                  <description>No safety alarm reported from DMA-system AXBS IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_SYS_GSKT_ALARM_EN_1</name>
                  <description>Safety alarm indicated by DMA-system AXBS IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_PERIPH_GSKT_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: IAHB gasket safety alarm from DMA periph AXBS IAHB gasket</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_PERIPH_GSKT_ALARM_EN_0</name>
                  <description>No safety alarm reported from DMA-periph AXBS IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_PERIPH_GSKT_ALARM_EN_1</name>
                  <description>Safety alarm indicated by DMA-periph AXBS IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYS_AXBS_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: system AXBS safety alarm.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYS_AXBS_ALARM_EN_0</name>
                  <description>No safety alarm indicated by system AXBS.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYS_AXBS_ALARM_EN_1</name>
                  <description>Safety alarm indicated by system AXBS.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_AXBS_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: DMA AXBS_Lite safety alarm</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_AXBS_ALARM_EN_0</name>
                  <description>No safety alarm indicated by DMA AXBS_Lite.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_AXBS_ALARM_EN_1</name>
                  <description>Safety alarm indicated by DMA AXBS_Lite.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_GSKT_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: HSE IAHB gasket alarm.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE_GSKT_ALARM_EN_0</name>
                  <description>No alarm indicated by HSE IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_GSKT_ALARM_EN_1</name>
                  <description>Alarm indicated by HSE IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QSPI_GSKT_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: QSPI IAHB gasket alarm.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QSPI_GSKT_ALARM_EN_0</name>
                  <description>No alarm indicated by QSPI IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QSPI_GSKT_ALARM_EN_1</name>
                  <description>Alarm indicated by QSPI IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIPS1_GSKT_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: AIPS1 IAHB gasket alarm.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIPS1_GSKT_ALARM_EN_0</name>
                  <description>No alarm indicated by AIPS1 IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIPS1_GSKT_ALARM_EN_1</name>
                  <description>Alarm indicated by AIPS1 IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIPS2_GSKT_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: AIPS2 IAHB gasket alarm.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIPS2_GSKT_ALARM_EN_0</name>
                  <description>No alarm indicated by AIPS2 IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIPS2_GSKT_ALARM_EN_1</name>
                  <description>Alarm indicated by AIPS2 IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_EDC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: integrity error on address for safety</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_EDC_ERR_EN_0</name>
                  <description>No integrity error on address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_EDC_ERR_EN_1</name>
                  <description>Address integrity error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_EDC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: integrity error on data for safety</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_EDC_ERR_EN_0</name>
                  <description>No integrity error on data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_EDC_ERR_EN_1</name>
                  <description>Data integrity error..</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCM_AXBS_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: TCM AHB splitter safety alarm</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCM_AXBS_ALARM_EN_0</name>
                  <description>No safety alarm indicated by TCM AHB splitter.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_AXBS_ALARM_EN_1</name>
                  <description>Safety alarm indicated by TCM AHB splitter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_GSKT_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: EMAC IAHB gasket alarm.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_GSKT_ALARM_EN_0</name>
                  <description>No alarm indicated by EMAC IAHB gasket.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_GSKT_ALARM_EN_1</name>
                  <description>Alarm indicated by EMAC IAHB gasket.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERIPH_AXBS_ALARM_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: PERIPH AXBS_Lite safety alarm</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_AXBS_ALARM_EN_0</name>
                  <description>No safety alarm indicated by Periph AXBS_Lite.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_AXBS_ALARM_EN_1</name>
                  <description>Safety alarm indicated by Periph AXBS_Lite.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 3 for the fault: Error in lifecycle scanning</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LC_ERR_EN_0</name>
                  <description>No error while lifecycle scanning.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LC_ERR_EN_1</name>
                  <description>Error while lifecycle scanning.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRAM1_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Multi bit ECC error from SRAM1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRAM1_ECC_ERR_EN_0</name>
                  <description>No multi-bit ECC error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRAM1_ECC_ERR_EN_1</name>
                  <description>Multi-bit ECC error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRAM0_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Multi bit ECC error from SRAM0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRAM0_ECC_ERR_EN_0</name>
                  <description>No multi-bit ECC error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRAM0_ECC_ERR_EN_1</name>
                  <description>Multi-bit ECC error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_DCDATA_ECC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 2 for the fault: Multi bit ECC error from CM7_0 DCache data memory</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_DCDATA_ECC_ERR_EN_0</name>
                  <description>No multi-bit ECC error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_DCDATA_ECC_ERR_EN_1</name>
                  <description>Multi-bit ECC error.</description>
                  <value>0x1</value>
