linzhi813/ems_s32k/config/S32K344.svd
                  <description>No go indication referring to the supply being unclean and a fault in double bond connection or its routing within the chip.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST_ACTIVATION_0_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 5 for the fault: Accidental partial test activation</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEST_ACTIVATION_0_ERR_EN_0</name>
                  <description>No partial test activated accidentally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_ACTIVATION_0_ERR_EN_1</name>
                  <description>Partial test activated accidentally.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEST_ACTIVATION_1_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 5 for the fault: Accidental partial test activation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEST_ACTIVATION_1_ERR_EN_0</name>
                  <description>No partial test activated accidentally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_ACTIVATION_1_ERR_EN_1</name>
                  <description>Partial test activated accidentally.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWD5</name>
          <description>Read Write GPR On Destructive Reset Register</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7FFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTM_0_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 6 for the fault: Interrupt monitor0 error reported by INTM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTM_0_ERR_EN_0</name>
                  <description>No error reported by interrupt monitor 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTM_0_ERR_EN_1</name>
                  <description>Error reported by interrupt monitor 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTM_1_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 6 for the fault: Interrupt monitor1 error reported by error reported by INTM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTM_1_ERR_EN_0</name>
                  <description>No error reported by interrupt monitor 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTM_1_ERR_EN_1</name>
                  <description>Error reported by interrupt monitor 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTM_2_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 6 for the fault: Interrupt monitor2 error reported by error reported by INTM</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTM_2_ERR_EN_0</name>
                  <description>No error reported by interrupt monitor 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTM_2_ERR_EN_1</name>
                  <description>Error reported by interrupt monitor 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTM_3_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 6 for the fault: Interrupt monitor3 error reported by error reported by INTM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTM_3_ERR_EN_0</name>
                  <description>No error reported by interrupt monitor 3.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTM_3_ERR_EN_1</name>
                  <description>Error reported by interrupt monitor 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_NCF_0_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 7 for the fault: Software NCF0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_NCF_0_EN_0</name>
                  <description>Software NCF0, DCMRWF1[FCCU_SW_NCF0] not enabled by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_NCF_0_EN_1</name>
                  <description>Software NCF0, DCMRWF1[FCCU_SW_NCF0] enabled by software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_NCF_1_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 7 for the fault: Software NCF1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_NCF_1_EN_0</name>
                  <description>Software NCF1, DCMRWF1[FCCU_SW_NCF1] not enabled by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_NCF_1_EN_1</name>
                  <description>Software NCF1, DCMRWF1[FCCU_SW_NCF1] enabled by software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_NCF_2_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 7 for the fault: Software NCF2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_NCF_2_EN_0</name>
                  <description>Software NCF2, DCMRWF1[FCCU_SW_NCF2] not enabled by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_NCF_2_EN_1</name>
                  <description>Software NCF2, DCMRWF1[FCCU_SW_NCF2] enabled by software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_NCF_3_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 7 for the fault: Software NCF3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_NCF_3_EN_0</name>
                  <description>Software NCF3, DCMRWF1[FCCU_SW_NCF3] not enabled by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_NCF_3_EN_1</name>
                  <description>Software NCF3, DCMRWF1[FCCU_SW_NCF3] enabled by software.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STCU_NCF_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 5 for the fault: STCU non-critical fault, that is, BIST result error</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STCU_NCF_EN_0</name>
                  <description>STCU non-critical fault not reported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STCU_NCF_EN_1</name>
                  <description>STCU non-critical fault reported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBIST_ACTIVATION_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 5 for the fault: Indicates an accidental backdoor access on memories</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MBIST_ACTIVATION_ERR_EN_0</name>
                  <description>No accidental backdoor enabled on memories.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBIST_ACTIVATION_ERR_EN_1</name>
                  <description>Accidental backdoor enabled on memories.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STCU_BIST_USER_CF_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 5 for the fault: L/M BIST enabled accidentally</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STCU_BIST_USER_CF_EN_0</name>
                  <description>No accidental L/M BIST enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STCU_BIST_USER_CF_EN_1</name>
                  <description>Accidental L/M BIST enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTR_BUS_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 5 for the fault: Fault reported due to illegal access on MTR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MTR_BUS_ERR_EN_0</name>
                  <description>No transfer error indicated from MTR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MTR_BUS_ERR_EN_1</name>
                  <description>Transfer error indicated from MTR.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG_ACTIVATION_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 5 for the fault: Monitoring of unintended debug activation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBUG_ACTIVATION_ERR_EN_0</name>
                  <description>Unintended debug not activated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBUG_ACTIVATION_ERR_EN_1</name>
                  <description>Unintended debug activated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCM_RDATA_EDC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: Integrity(EDC) error on TCM read data for safety</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCM_RDATA_EDC_ERR_EN_0</name>
                  <description>No integrity error reported on TCM read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM_RDATA_EDC_ERR_EN_1</name>
                  <description>Integrity error reported on TCM read data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_RDATA_EDC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: Integrity(EDC) error on EMAC read data for safety</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_RDATA_EDC_ERR_EN_0</name>
                  <description>No integrity error reported on EMAC read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_RDATA_EDC_ERR_EN_1</name>
                  <description>Integrity error reported on EMAC read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_RDATA_EDC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: Integrity(EDC) error on eDMA read data for safety</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_RDATA_EDC_ERR_EN_0</name>
                  <description>No integrity error reported on eDMA read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_RDATA_EDC_ERR_EN_1</name>
                  <description>Integrity error reported on eDMA read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_AHBP_RDATA_EDC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: Integrity error on CM7_0 peripheral read data for safety</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_AHBP_RDATA_EDC_ERR_EN_0</name>
                  <description>No integrity error reported on CM7_0 peripheral read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_AHBP_RDATA_EDC_ERR_EN_1</name>
                  <description>Integrity error reported on CM7_0 peripheral read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_AHBM_RDATA_EDC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: Integrity error on CM7_0 main read data for safety</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_AHBM_RDATA_EDC_ERR_EN_0</name>
                  <description>No integrity error reported on CM7_0 main read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_AHBM_RDATA_EDC_ERR_EN_1</name>
                  <description>Integrity error reported on CM7_0 main read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_RDATA_EDC_ERR_EN</name>
              <description>Enable bit for enabling the fault monitoring at FCCU NCF 1 for the fault: Integrity (EDC) error on HSE read data for safety</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE_RDATA_EDC_ERR_EN_0</name>
                  <description>No integrity error reported on HSE read data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_RDATA_EDC_ERR_EN_1</name>
                  <description>Integrity error reported on HSE read data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
