linzhi813/ems_s32k/config/S32K344.svd
                  <description>FLEXCAN1 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN1_DBG_DIS_CM7_0_1</name>
                  <description>FLEXCAN1 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN2_DBG_DIS_CM7_0</name>
              <description>FLEXCAN2 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN2_DBG_DIS_CM7_0_0</name>
                  <description>FLEXCAN2 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN2_DBG_DIS_CM7_0_1</name>
                  <description>FLEXCAN2 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN3_DBG_DIS_CM7_0</name>
              <description>FLEXCAN3 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN3_DBG_DIS_CM7_0_0</name>
                  <description>FLEXCAN3 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN3_DBG_DIS_CM7_0_1</name>
                  <description>FLEXCAN3 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN4_DBG_DIS_CM7_0</name>
              <description>FLEXCAN4 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN4_DBG_DIS_CM7_0_0</name>
                  <description>FLEXCAN4 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN4_DBG_DIS_CM7_0_1</name>
                  <description>FLEXCAN4 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN5_DBG_DIS_CM7_0</name>
              <description>FLEXCAN5 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN5_DBG_DIS_CM7_0_0</name>
                  <description>FLEXCAN5 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN5_DBG_DIS_CM7_0_1</name>
                  <description>FLEXCAN5 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI0_DBG_DIS_CM7_0</name>
              <description>SAI0 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI0_DBG_DIS_CM7_0_0</name>
                  <description>SAI0 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI0_DBG_DIS_CM7_0_1</name>
                  <description>SAI0 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1_DBG_DIS_CM7_0</name>
              <description>SAI1 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1_DBG_DIS_CM7_0_0</name>
                  <description>SAI1 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI1_DBG_DIS_CM7_0_1</name>
                  <description>SAI1 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWD7</name>
          <description>Read Write GPR On Destructive Reset Register</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DCMRWD8</name>
          <description>Read Write GPR On Destructive Reset Register</description>
          <addressOffset>0x51C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DCMRWD9</name>
          <description>Read Write GPR On Destructive Reset Register</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DCMRWF1</name>
          <description>Read Write GPR On Functional Reset Register</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAN_TIMESTAMP_SEL</name>
              <description>Select between EMAC and STM for CAN timestamping</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_TIMESTAMP_SEL_0</name>
                  <description>EMAC selected for CAN timestamping.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_TIMESTAMP_SEL_1</name>
                  <description>STM0 selected for CAN timestamping.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_TIMESTAMP_EN</name>
              <description>Enables CAN timestamping feature for all flexcans.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_TIMESTAMP_EN_0</name>
                  <description>CAN timestamping is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_TIMESTAMP_EN_1</name>
                  <description>CAN timestamping is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_SW_NCF0</name>
              <description>Control to initiate Software NCF to FCCU.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCU_SW_NCF0_0</name>
                  <description>NCF to FCCU will not be generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCU_SW_NCF0_1</name>
                  <description>NCF to FCCU will be generated. For exact slot of FCCU, please refer FCCU chapter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_SW_NCF1</name>
              <description>Control to initiate Software NCF to FCCU.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCU_SW_NCF1_0</name>
                  <description>NCF to FCCU will not be generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCU_SW_NCF1_1</name>
                  <description>NCF to FCCU will be generated. For exact slot of FCCU, please refer FCCU chapter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_SW_NCF2</name>
              <description>Control to initiate Software NCF to FCCU.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCU_SW_NCF2_0</name>
                  <description>NCF to FCCU will not be generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCU_SW_NCF2_1</name>
                  <description>NCF to FCCU will be generated. For exact slot of FCCU, please refer FCCU chapter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_SW_NCF3</name>
              <description>Control to initiate Software NCF to FCCU.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCU_SW_NCF3_0</name>
                  <description>NCF to FCCU will not be generated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCU_SW_NCF3_1</name>
                  <description>NCF to FCCU will be generated. For exact slot of FCCU, please refer FCCU chapter.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RMII_MII_SEL</name>
              <description>Selects between MII and RMII mode of ethernet.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RMII_MII_SEL_0</name>
                  <description>MII mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMII_MII_SEL_1</name>
                  <description>RMII mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD_HV_B_IO_CTRL_LATCH</name>
              <description>Controls the IO controls latching in low frequency RUN mode to reduce power consumption on VDD_HV_B domain pins.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD_HV_B_IO_CTRL_LATCH_0</name>
                  <description>VDD_HV_B domain pins function as normal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD_HV_B_IO_CTRL_LATCH_1</name>
                  <description>The IO controls of VDD_HV_B domain pins are latched.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STANDBY_IO_CONFIG</name>
              <description>Controls the IO state in the standby mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDBY_IO_CONFIG_0</name>
                  <description>STANDBY IO configuration standby entry: Must be written as 0 before IO configurations are done in standby entry sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY_IO_CONFIG_1</name>
                  <description>STANDBY IO configuration standby exit: Must be written as 1 after IO configurations are done on standby exit.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPPLY_MON_EN</name>
              <description>Enable the supply voltage monitoring by ADC.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPLY_MON_EN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPPLY_MON_SEL</name>
              <description>Selects the source of voltage used by ADC for supply monitoring</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_0</name>
                  <description>VDD_HV_A_DIV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_1</name>
                  <description>VDD_HV_B_DIV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_2</name>
                  <description>VDD_1.5_DIV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_3</name>
                  <description>VDD_2.5_OSC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_4</name>
                  <description>VDD1.1_PD1_HOT_POINT</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_5</name>
                  <description>VDD1.1_PD1_COLD_POINT</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_6</name>
                  <description>VDD1.1_PLL</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_7</name>
                  <description>VDD1.1_PD0</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSS_LV_ANMUX_EN</name>
              <description>Enable VSS_LV monitoring</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSS_LV_ANMUX_EN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS_LV_ANMUX_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD_HV_A_VLT_DVDR_EN</name>
              <description>Enable for VDD_HV_A 2:1 divider for voltage measurement using supply voltage monitoring by ADC.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD_HV_A_VLT_DVDR_EN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD_HV_A_VLT_DVDR_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD_HV_B_VLT_DVDR_EN</name>
              <description>Enable for VDD_HV_B 2:1 divider for voltage measurement using supply voltage monitoring by ADC.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD_HV_B_VLT_DVDR_EN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD_HV_B_VLT_DVDR_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD_1_5_VLT_DVDR_EN</name>
              <description>Enable for VDD1P5 2:1 divider for voltage measurement using supply voltage monitoring by ADC.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD_1_5_VLT_DVDR_EN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD_1_5_VLT_DVDR_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
