linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>DCMROPP3</name>
          <description>Read Only GPR On PMCPOR Reset</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>POR_WDG_STAT64</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT64_0</name>
                  <description>MC_RGM.RGM_DES[0] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT64_1</name>
                  <description>MC_RGM.RGM_DES[0] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT65</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT65_0</name>
                  <description>MC_RGM.RGM_DES[1] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT65_1</name>
                  <description>MC_RGM.RGM_DES[1] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT66</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT66_0</name>
                  <description>MC_RGM.RGM_DES[2] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT66_1</name>
                  <description>MC_RGM.RGM_DES[2] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT67</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT67_0</name>
                  <description>MC_RGM.RGM_DES[3] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT67_1</name>
                  <description>MC_RGM.RGM_DES[3] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT68</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT68_0</name>
                  <description>MC_RGM.RGM_DES[4] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT68_1</name>
                  <description>MC_RGM.RGM_DES[4] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT69</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT69_0</name>
                  <description>MC_RGM.RGM_DES[5] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT69_1</name>
                  <description>MC_RGM.RGM_DES[5] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT70</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT70_0</name>
                  <description>MC_RGM.RGM_DES[6] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT70_1</name>
                  <description>MC_RGM.RGM_DES[6] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT71</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT71_0</name>
                  <description>MC_RGM.RGM_DES[7] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT71_1</name>
                  <description>MC_RGM.RGM_DES[7] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT72</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT72_0</name>
                  <description>MC_RGM.RGM_DES[8] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT72_1</name>
                  <description>MC_RGM.RGM_DES[8] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT73</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT73_0</name>
                  <description>MC_RGM.RGM_DES[9] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT73_1</name>
                  <description>MC_RGM.RGM_DES[9] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT74</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT74_0</name>
                  <description>MC_RGM.RGM_DES[10] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT74_1</name>
                  <description>MC_RGM.RGM_DES[10] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT75</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT75_0</name>
                  <description>MC_RGM.RGM_DES[11] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT75_1</name>
                  <description>MC_RGM.RGM_DES[11] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT76</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT76_0</name>
                  <description>MC_RGM.RGM_DES[12] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT76_1</name>
                  <description>MC_RGM.RGM_DES[12] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT77</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT77_0</name>
                  <description>MC_RGM.RGM_DES[13] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT77_1</name>
                  <description>MC_RGM.RGM_DES[13] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT78</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT78_0</name>
                  <description>MC_RGM.RGM_DES[14] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT78_1</name>
                  <description>MC_RGM.RGM_DES[14] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT79</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT79_0</name>
                  <description>MC_RGM.RGM_DES[15] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT79_1</name>
                  <description>MC_RGM.RGM_DES[15] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT80</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT80_0</name>
                  <description>MC_RGM.RGM_DES[16] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT80_1</name>
                  <description>MC_RGM.RGM_DES[16] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT81</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT81_0</name>
                  <description>MC_RGM.RGM_DES[17] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT81_1</name>
                  <description>MC_RGM.RGM_DES[17] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT82</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT82_0</name>
                  <description>MC_RGM.RGM_DES[18] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT82_1</name>
                  <description>MC_RGM.RGM_DES[18] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT83</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT83_0</name>
                  <description>MC_RGM.RGM_DES[19] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT83_1</name>
                  <description>MC_RGM.RGM_DES[19] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT84</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT84_0</name>
                  <description>MC_RGM.RGM_DES[20] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT84_1</name>
                  <description>MC_RGM.RGM_DES[20] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT85</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT85_0</name>
                  <description>MC_RGM.RGM_DES[21] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT85_1</name>
                  <description>MC_RGM.RGM_DES[21] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT86</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT86_0</name>
                  <description>MC_RGM.RGM_DES[22] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT86_1</name>
                  <description>MC_RGM.RGM_DES[22] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT87</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT87_0</name>
                  <description>MC_RGM.RGM_DES[23] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT87_1</name>
                  <description>MC_RGM.RGM_DES[23] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT88</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT88_0</name>
                  <description>MC_RGM.RGM_DES[24] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT88_1</name>
