linzhi813/ems_s32k/config/S32K344.svd
                  <description>MC_RGM.RGM_DES[24] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT89</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT89_0</name>
                  <description>MC_RGM.RGM_DES[25] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT89_1</name>
                  <description>MC_RGM.RGM_DES[25] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT90</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT90_0</name>
                  <description>MC_RGM.RGM_DES[26] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT90_1</name>
                  <description>MC_RGM.RGM_DES[26] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT91</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT91_0</name>
                  <description>MC_RGM.RGM_DES[27] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT91_1</name>
                  <description>MC_RGM.RGM_DES[27] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT92</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT92_0</name>
                  <description>MC_RGM.RGM_DES[28] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT92_1</name>
                  <description>MC_RGM.RGM_DES[28] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT93</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT93_0</name>
                  <description>MC_RGM.RGM_DES[29] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT93_1</name>
                  <description>MC_RGM.RGM_DES[29] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT94</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT94_0</name>
                  <description>MC_RGM.RGM_DES[30] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT94_1</name>
                  <description>MC_RGM.RGM_DES[30] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT95</name>
              <description>This bit captures MC_RGM destructive event status register when POR_WDG overflows.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT95_0</name>
                  <description>MC_RGM.RGM_DES[31] is 0 when POR_WDG overflows.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT95_1</name>
                  <description>MC_RGM.RGM_DES[31] is 1 when POR_WDG overflows.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMROPP4</name>
          <description>Read Only GPR On PMCPOR Reset</description>
          <addressOffset>0x70C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>POR_WDG_STAT96</name>
              <description>This bit captures POR_WDG reset event if POR_WDG initiates a POR sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT96_0</name>
                  <description>POR_WDG is inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT96_1</name>
                  <description>POR_WDG has detected a stuck scenario and raised device POR event. Refer POR_WDG_STAT[95:0] for device status when POR_WDG overflows</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
