linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>GRP2_OBE1</name>
          <description>Group OBE</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OBE0</name>
              <description>Output Buffer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE0_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE0_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE1</name>
              <description>Output Buffer Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE1_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE1_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE2</name>
              <description>Output Buffer Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE2_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE2_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE3</name>
              <description>Output Buffer Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE3_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE3_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE4</name>
              <description>Output Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE4_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE4_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE5</name>
              <description>Output Buffer Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE5_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE5_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE6</name>
              <description>Output Buffer Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE6_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE6_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE7</name>
              <description>Output Buffer Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE7_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE7_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE8</name>
              <description>Output Buffer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE8_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE8_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE9</name>
              <description>Output Buffer Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE9_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE9_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE10</name>
              <description>Output Buffer Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE10_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE10_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE11</name>
              <description>Output Buffer Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE11_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE11_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE12</name>
              <description>Output Buffer Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE12_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE12_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE13</name>
              <description>Output Buffer Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE13_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE13_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE14</name>
              <description>Output Buffer Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE14_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE14_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE15</name>
              <description>Output Buffer Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE15_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE15_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE16</name>
              <description>Output Buffer Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE16_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE16_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE17</name>
              <description>Output Buffer Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE17_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE17_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE18</name>
              <description>Output Buffer Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE18_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE18_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE19</name>
              <description>Output Buffer Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE19_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE19_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE20</name>
              <description>Output Buffer Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE20_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE20_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE21</name>
              <description>Output Buffer Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE21_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE21_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE22</name>
              <description>Output Buffer Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE22_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE22_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE23</name>
              <description>Output Buffer Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE23_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE23_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE24</name>
              <description>Output Buffer Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE24_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE24_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE25</name>
              <description>Output Buffer Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE25_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE25_value1</name>
