linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>ERRSR</name>
          <description>Error Status Register</description>
          <addressOffset>0xAFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>CEIOF</name>
              <description>Correctable Error Interrupt Overrun Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_overrun</name>
                  <description>No overrun on correctable errors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>overrun</name>
                  <description>Overrun on correctable errors</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FANCEIOF</name>
              <description>FlexCAN Access With Non-Correctable Error Interrupt Overrun Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_overrun</name>
                  <description>No overrun on non-correctable errors in FlexCAN access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>overrun</name>
                  <description>Overrun on non-correctable errors in FlexCAN access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HANCEIOF</name>
              <description>Host Access With Non-Correctable Error Interrupt Overrun Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_overrun</name>
                  <description>No overrun on non-correctable errors in host access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>overrun</name>
                  <description>Overrun on non-correctable errors in host access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CEIF</name>
              <description>Correctable Error Interrupt Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_errors</name>
                  <description>No correctable errors were detected so far.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>errors</name>
                  <description>A correctable error was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FANCEIF</name>
              <description>FlexCAN Access With Non-Correctable Error Interrupt Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_found</name>
                  <description>No non-correctable errors were detected in FlexCAN accesses so far.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>found</name>
                  <description>A non-correctable error was detected in a FlexCAN access.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HANCEIF</name>
              <description>Host Access With Non-Correctable Error Interrupt Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_found</name>
                  <description>No non-correctable errors were detected in host accesses so far.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>found</name>
                  <description>A non-correctable error was detected in a host access.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPRS</name>
          <description>Enhanced CAN Bit Timing Prescalers</description>
          <addressOffset>0xBF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENPRESDIV</name>
              <description>Extended Nominal Prescaler Division Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDPRESDIV</name>
              <description>Extended Data Phase Prescaler Division Factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENCBT</name>
          <description>Enhanced Nominal CAN Bit Timing</description>
          <addressOffset>0xBF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NTSEG1</name>
              <description>Nominal Time Segment 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NTSEG2</name>
              <description>Nominal Time Segment 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRJW</name>
              <description>Nominal Resynchronization Jump Width</description>
              <bitOffset>22</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EDCBT</name>
          <description>Enhanced Data Phase CAN bit Timing</description>
          <addressOffset>0xBF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTSEG1</name>
              <description>Data Phase Segment 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTSEG2</name>
              <description>Data Phase Time Segment 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DRJW</name>
              <description>Data Phase Resynchronization Jump Width</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETDC</name>
          <description>Enhanced Transceiver Delay Compensation</description>
          <addressOffset>0xBFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ETDCVAL</name>
              <description>Enhanced Transceiver Delay Compensation Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETDCFAIL</name>
              <description>Transceiver Delay Compensation Fail</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>in_range</name>
                  <description>Measured loop delay is in range.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>out_of_range</name>
                  <description>Measured loop delay is out of range.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETDCOFF</name>
              <description>Enhanced Transceiver Delay Compensation Offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDMDIS</name>
              <description>Transceiver Delay Measurement Disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>TDC measurement is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>TDC measurement is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETDCEN</name>
              <description>Transceiver Delay Compensation Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>TDC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>TDC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCTRL</name>
          <description>CAN FD Control Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDCVAL</name>
              <description>Transceiver Delay Compensation Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TDCOFF</name>
              <description>Transceiver Delay Compensation Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDCFAIL</name>
              <description>Transceiver Delay Compensation Fail</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>in_range</name>
                  <description>Measured loop delay is in range.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>out_of_range</name>
                  <description>Measured loop delay is out of range.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDCEN</name>
              <description>Transceiver Delay Compensation Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>TDC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>TDC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBDSR0</name>
              <description>Message Buffer Data Size for Region 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R0_8_bytes</name>
                  <description>Selects 8 bytes per message buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R0_16_bytes</name>
                  <description>Selects 16 bytes per message buffer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R0_32_bytes</name>
                  <description>Selects 32 bytes per message buffer.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R0_64_bytes</name>
                  <description>Selects 64 bytes per message buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBDSR1</name>
              <description>Message Buffer Data Size for Region 1</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R1_8_bytes</name>
                  <description>Selects 8 bytes per message buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R1_16_bytes</name>
                  <description>Selects 16 bytes per message buffer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R1_32_bytes</name>
                  <description>Selects 32 bytes per message buffer.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R1_64_bytes</name>
                  <description>Selects 64 bytes per message buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBDSR2</name>
              <description>Message Buffer Data Size for Region 2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R2_8_bytes</name>
                  <description>Selects 8 bytes per message buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R2_16_bytes</name>
                  <description>Selects 16 bytes per message buffer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R2_32_bytes</name>
                  <description>Selects 32 bytes per message buffer.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R2_64_bytes</name>
                  <description>Selects 64 bytes per message buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDRATE</name>
              <description>Bit Rate Switch Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nominal</name>
                  <description>Transmit a frame in nominal rate. The BRS bit in the Tx MB has no effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit_rate_switching</name>
                  <description>Transmit a frame with bit rate switching if the BRS bit in the Tx MB is recessive.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCBT</name>
          <description>CAN FD Bit Timing Register</description>
          <addressOffset>0xC04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPSEG2</name>
              <description>Fast Phase Segment 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPSEG1</name>
              <description>Fast Phase Segment 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPROPSEG</name>
              <description>Fast Propagation Segment</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRJW</name>
              <description>Fast Resync Jump Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPRESDIV</name>
              <description>Fast Prescaler Division Factor</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCRC</name>
          <description>CAN FD CRC Register</description>
          <addressOffset>0xC08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FD_TXCRC</name>
              <description>Extended Transmitted CRC value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FD_MBCRC</name>
              <description>CRC Mailbox Number for FD_TXCRC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
