linzhi813/ems_s32k/config/S32K344.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="CAN_1">
      <name>CAN_2</name>
      <description>CAN</description>
      <groupName>FLEXCAN</groupName>
      <baseAddress>0x4030C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xD30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FlexCAN2_0</name>
        <value>116</value>
      </interrupt>
      <interrupt>
        <name>FlexCAN2_1</name>
        <value>117</value>
      </interrupt>
      <interrupt>
        <name>FlexCAN2_2</name>
        <value>118</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CAN_3</name>
      <description>CAN</description>
      <groupName>FLEXCAN</groupName>
      <headerStructName>CAN_3</headerStructName>
      <baseAddress>0x40310000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xCB0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FlexCAN3_0</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>FlexCAN3_1</name>
        <value>120</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR</name>
          <description>Module Configuration Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xD890000F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAXMB</name>
              <description>Number Of The Last Message Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDAM</name>
              <description>ID Acceptance Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>one_full_ID</name>
                  <description>Format A: One full ID (standard and extended) per ID filter table element.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>two_full_ID</name>
                  <description>Format B: Two full standard IDs or two partial 14-bit (standard and extended) IDs per ID filter table element.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>four_partial_ID</name>
                  <description>Format C: Four partial 8-bit standard IDs per ID filter table element.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>all_frames_rejected</name>
                  <description>Format D: All frames rejected.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDEN</name>
              <description>CAN FD operation enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_FD_disabled</name>
                  <description>CAN FD is disabled. FlexCAN is able to receive and transmit messages in CAN 2.0 format.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_FD_enabled</name>
                  <description>CAN FD is enabled. FlexCAN is able to receive and transmit messages in both CAN FD and CAN 2.0 formats.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AEN</name>
              <description>Abort Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>abort_disabled</name>
                  <description>Abort disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>abort_enabled</name>
                  <description>Abort enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPRIOEN</name>
              <description>Local Priority Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>local_priority_disabled</name>
                  <description>Local Priority disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>local_priority_enabled</name>
                  <description>Local Priority enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA</name>
              <description>DMA Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id2</name>
                  <description>DMA feature for RX FIFO disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id4</name>
                  <description>DMA feature for RX FIFO enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRMQ</name>
              <description>Individual Rx Masking And Queue Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>individual_rx_masking_disabled</name>
                  <description>Individual Rx masking and queue feature are disabled. For backward compatibility with legacy applications, the reading of C/S word locks the MB even if it is EMPTY.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>individual_rx_masking_enabled</name>
                  <description>Individual Rx masking and queue feature are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRXDIS</name>
              <description>Self Reception Disable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>self_reception_enabled</name>
                  <description>Self-reception enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>self_reception_disabled</name>
                  <description>Self-reception disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMACK</name>
              <description>Low-Power Mode Acknowledge</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low_power_no</name>
                  <description>FlexCAN is not in a low-power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>low_power_yes</name>
                  <description>FlexCAN is in a low-power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRNEN</name>
              <description>Warning Interrupt Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWRNINT_RWRNINT_inactive</name>
                  <description>TWRNINT and RWRNINT bits are zero, independent of the values in the error counters.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWRNINT_RWRNINT_active</name>
                  <description>TWRNINT and RWRNINT bits are set when the respective error counter transitions from less than 96 to greater than or equal to 96.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPV</name>
              <description>Supervisor Mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id2</name>
                  <description>FlexCAN is in User mode. Affected registers allow both Supervisor and Unrestricted accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id4</name>
                  <description>FlexCAN is in Supervisor mode. Affected registers allow only Supervisor access. Unrestricted access behaves as though the access was done to an unimplemented register location.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRZACK</name>
              <description>Freeze Mode Acknowledge</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>freeze_mode_no</name>
                  <description>FlexCAN not in Freeze mode, prescaler running.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freeze_mode_yes</name>
                  <description>FlexCAN in Freeze mode, prescaler stopped.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFTRST</name>
              <description>Soft Reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFTRST_no_reset_request</name>
                  <description>No reset request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFTRST_reset_registers</name>
                  <description>Resets the registers affected by soft reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NOTRDY</name>
              <description>FlexCAN Not Ready</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id1</name>
                  <description>FlexCAN module is either in Normal mode, Listen-Only mode, or Loop-Back mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id5</name>
                  <description>FlexCAN module is either in Disable mode or Freeze mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt FlexCAN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HALT_disable</name>
                  <description>No Freeze mode request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT_enable</name>
                  <description>Enters Freeze mode if the FRZ bit is asserted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFEN</name>
              <description>Rx FIFO Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id2</name>
                  <description>Rx FIFO not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id4</name>
                  <description>Rx FIFO enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRZ</name>
              <description>Freeze Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>freeze_mode_disabled</name>
                  <description>Not enabled to enter Freeze mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>freeze_mode_enabled</name>
                  <description>Enabled to enter Freeze mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MDIS</name>
              <description>Module Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>flexcan_enabled</name>
                  <description>Enable the FlexCAN module.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flexcan_disabled</name>
                  <description>Disable the FlexCAN module.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
