linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>RSR</name>
          <description>Receive Status Register</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RF0</name>
              <description>MUB Receive Register n Full</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>MUB RRn register is not full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>MUB RRn register has received data from MUA TRn register and is ready to be read by the MUB.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF1</name>
              <description>MUB Receive Register n Full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>MUB RRn register is not full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>MUB RRn register has received data from MUA TRn register and is ready to be read by the MUB.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF2</name>
              <description>MUB Receive Register n Full</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>MUB RRn register is not full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>MUB RRn register has received data from MUA TRn register and is ready to be read by the MUB.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF3</name>
              <description>MUB Receive Register n Full</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>MUB RRn register is not full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>MUB RRn register has received data from MUA TRn register and is ready to be read by the MUB.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TR[%s]</name>
          <description>Transmit Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TR_DATA</name>
              <description>MUB Transmit Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RR[%s]</name>
          <description>Receive Register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RR_DATA</name>
              <description>MUB Receive Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="MU_0__MUB">
      <name>MU_1__MUB</name>
      <description>MUB</description>
      <groupName>MU</groupName>
      <baseAddress>0x404EC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x290</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>JDC</name>
      <description>JDC</description>
      <groupName>JDC</groupName>
      <baseAddress>0x40394000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>JDC</name>
        <value>178</value>
      </interrupt>
      <registers>
        <register>
          <name>MCR</name>
          <description>Module Configuration Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JOUT_IEN</name>
              <description>JOUT Interrupt Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JOUT_IEN_0</name>
                  <description>Setting MSR[JOUT_INT] bit does not assert the JOUT interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JOUT_IEN_1</name>
                  <description>Setting MSR[JOUT_INT] bit asserts the JOUT interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JIN_IEN</name>
              <description>JIN Interrupt Enable.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JIN_IEN_0</name>
                  <description>Setting MSR[JIN_INT] bit does not assert the JIN interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JIN_IEN_1</name>
                  <description>Setting MSR[JIN_INT] bit asserts the JIN interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MSR</name>
          <description>Module Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JOUT_INT</name>
              <description>JOUT Interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JOUT_INT_0</name>
                  <description>Cleared by writing logic 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JOUT_INT_1</name>
                  <description>Set when JOUT_RDY bit is cleared by tool reading JOUT register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JOUT_RDY</name>
              <description>JOUT Ready (read only).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JOUT_RDY_0</name>
                  <description>Cleared upon tool read of JOUT register via JTAG port</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JOUT_RDY_1</name>
                  <description>Set when new data is written to the JOUT_IPS register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JIN_INT</name>
              <description>JIN Interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JIN_INT_0</name>
                  <description>Cleared by writing logic 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JIN_INT_1</name>
                  <description>Set when new data is written to the JIN_IPS register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JIN_RDY</name>
              <description>JIN Ready (read only).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JIN_RDY_0</name>
                  <description>Cleared upon software read of JIN_IPS contents via IPS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JIN_RDY_1</name>
                  <description>Set when new data is written to the JIN_IPS register</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JOUT_IPS</name>
          <description>JTAG Output Data Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Data</name>
              <description>JOUT_IPS data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JIN_IPS</name>
          <description>JTAG Input Data Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Data</name>
              <description>JIN_IPS data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
