linzhi813/ems_s32k/config/S32K344.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CONFIGURATION_GPR</name>
      <description>Configuration_GPR</description>
      <groupName>CONFIGURATION_GPR</groupName>
      <baseAddress>0x4039C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x68</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONFIG_REG0</name>
          <description>General Purpose Configuration 0</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDB</name>
              <description>Hardware Debugger Attached</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDB_0</name>
                  <description>Debugger not connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDB_1</name>
                  <description>Debugger connected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_REG6</name>
          <description>General Purpose Configuration 6</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x35</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUADSPI_SDID_PCTL</name>
              <description>QuadSPI Clock Gating</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUADSPI_SDID_PCTL_0</name>
                  <description>Clock is off (gated)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUADSPI_SDID_PCTL_1</name>
                  <description>Clock is on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_CLOCK_GATE</name>
              <description>Ethernet Clock Gating</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_CLOCK_GATE_0</name>
                  <description>Clock is off (gated)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_CLOCK_GATE_1</name>
                  <description>Clock is on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO_CLOCK_GATE</name>
              <description>FlexIO Clock Gating</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO_CLOCK_GATE_0</name>
                  <description>Clock is off (gated)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO_CLOCK_GATE_1</name>
                  <description>Clock is on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI_SDID_PCTL</name>
              <description>SAI0 and SAI1 clock gating</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI_SDID_PCTL_0</name>
                  <description>Clock is off (gated)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI_SDID_PCTL_1</name>
                  <description>Clock is on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HL</name>
              <description>Hard Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HL_0</name>
                  <description>You can write to this register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HL_1</name>
                  <description>Register is locked for any write</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_RAMPR</name>
          <description>Configuration RAM Protected Region</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SECURE_SIZE</name>
              <description>Secure Size</description>
              <bitOffset>5</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFT_LOCK</name>
              <description>Soft Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFT_LOCK_0</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFT_LOCK_1</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HARD_LOCK</name>
              <description>Hard Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HARD_LOCK_0</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARD_LOCK_1</name>
                  <description>Write access is not allowed until next functional reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_CFPRL</name>
          <description>Configuration Code Flash Memory Active Block</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SECURE_SIZE</name>
              <description>Secure Size</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFT_LOCK</name>
              <description>Soft Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFT_LOCK_0</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFT_LOCK_1</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HARD_LOCK</name>
              <description>Hard Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HARD_LOCK_0</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARD_LOCK_1</name>
                  <description>Write access is not allowed until next functional reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_CFPRH</name>
          <description>Configuration Code Flash Memory Passive Block</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SECURE_SIZE</name>
              <description>Secure Size</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFT_LOCK</name>
              <description>Soft Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFT_LOCK_0</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFT_LOCK_1</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HARD_LOCK</name>
              <description>Hard Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HARD_LOCK_0</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARD_LOCK_1</name>
                  <description>Write access is not allowed until next functional reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_DFPR</name>
          <description>Configuration Data Flash Memory Protected Region</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SECURE_SIZE</name>
              <description>Secure Size</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFT_LOCK</name>
              <description>Soft Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOFT_LOCK_0</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOFT_LOCK_1</name>
                  <description>Write access is not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HARD_LOCK</name>
              <description>Hard Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HARD_LOCK_0</name>
                  <description>Write access is allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARD_LOCK_1</name>
                  <description>Write access is not allowed until next functional reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_PE_LOCK</name>
          <description>Configuration Program and Erase Lock</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PE_LOCK_BLOCK_0</name>
              <description>Program/Erase Lock for Block 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PE_LOCK_BLOCK_0_0</name>
                  <description>Block 0 lock request is clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE_LOCK_BLOCK_0_1</name>
                  <description>Block 0 lock requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE_LOCK_BLOCK_1</name>
              <description>Program/Erase Lock for Block 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PE_LOCK_BLOCK_1_0</name>
                  <description>Block 1 lock request is clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE_LOCK_BLOCK_1_1</name>
                  <description>Block 1 lock requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE_LOCK_BLOCK_2</name>
              <description>Program/Erase Lock for Block 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PE_LOCK_BLOCK_2_0</name>
                  <description>Block 2 lock request is clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE_LOCK_BLOCK_2_1</name>
                  <description>Block 2 lock requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE_LOCK_BLOCK_3</name>
              <description>Program/Erase Lock for Block 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PE_LOCK_BLOCK_3_0</name>
                  <description>Block 3 lock request is clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE_LOCK_BLOCK_3_1</name>
                  <description>Block 3 lock requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE_LOCK_BLOCK_4</name>
              <description>Program/Erase Lock for Block 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PE_LOCK_BLOCK_4_0</name>
                  <description>Block 4 lock request is clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE_LOCK_BLOCK_4_1</name>
                  <description>Block 4 lock requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE_LOCK_UTEST</name>
              <description>Program/Erase Lock for UTEST</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PE_LOCK_UTEST_0</name>
                  <description>UTEST lock request is clear</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE_LOCK_UTEST_1</name>
                  <description>UTEST lock requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_RAMPR_ALT</name>
          <description>Configuration RAM Protected Region Alternate</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>INVERT_VALUE_RAMPR</name>
              <description>Invert Value RAMPR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_CFPRL_ALT</name>
          <description>Configuration Code Flash Memory Active Block Alternate</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>INVERT_VALUE_CFPRAB</name>
              <description>Invert Value CFPRAB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_CFPRH_ALT</name>
          <description>Configuration Code Flash Memory Passive Block Alternate</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>INVERT_VALUE_CFPRP</name>
              <description>Invert Value CFPRP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_DFPR_ALT</name>
          <description>Configuration Data Flash Memory Protected Region Alternate</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>INVERT_VALUE_DFPR</name>
              <description>Invert Value CFPRP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
