linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>CONFIG_REG_GPR</name>
          <description>Configuration REG_GPR</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0000003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIRC_DIV_SEL</name>
              <description>FIRC Divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRC_DIV_SEL_0</name>
                  <description>Divided by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRC_DIV_SEL_1</name>
                  <description>Divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRC_DIV_SEL_2</name>
                  <description>Divided by 16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRC_DIV_SEL_3</name>
                  <description>Undivided</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APP_CORE_ACC</name>
              <description>FIRC Divider</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APP_CORE_ACC_5</name>
                  <description>Application core can write this field [FIRC_DIV_SEL]</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>STCU</name>
      <description>STCU2</description>
      <groupName>STCU</groupName>
      <baseAddress>0x403A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2244</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>STCU_LBIST_MBIST</name>
        <value>191</value>
      </interrupt>
      <registers>
        <register>
          <name>RUNSW</name>
          <description>STCU2 Run Software</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RUNSW</name>
              <description>The RUNSW bit is automatically cleared by STCU2 when the online self-testing procedure is complete.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A8</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A9</name>
                  <description>Online self-testing procedure is running</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LBSWPLLEN</name>
              <description>Online LBIST with PLL Enabled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A12</name>
                  <description>Online LBIST is executed without using the on-chip PLL.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A13</name>
                  <description>Online LBIST is executed using the PLL configuration provided by the software. STCU2 does not take the PLL control but monitors the PLL lock signal to check if PLL is working correctly.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSWPLLEN</name>
              <description>Online MBIST with PLL Enabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A14</name>
                  <description>Online MBIST is executed without using the on-chip PLL.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A15</name>
                  <description>Online MBIST is executed using the PLL configuration provided by software. STCU2 does not take the PLL control but monitors the PLL lock signal to check if PLL is working correctly.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SKC</name>
          <description>STCU2 SK Code</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SKC</name>
              <description>STCU2 SK Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>STCU2 Configuration</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_CFG</name>
              <description>Logic, Memory BIST, and STCU2 CORE_CLK configuration CLK_CFG defines the ratio between the sys_clk and the internal clock used to program both the LBIST and the MBIST and the STCU2 CORE_CLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>sys_clk1</name>
                  <description>sys_clk/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sys_clk2</name>
                  <description>sys_clk/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sys_clk3</name>
                  <description>sys_clk/3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sys_clk4</name>
                  <description>sys_clk/4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sys_clk5</name>
                  <description>sys_clk/5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sys_clk6</name>
                  <description>sys_clk/6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sys_clk7</name>
                  <description>sys_clk/7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sys_clk8</name>
                  <description>sys_clk/8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRP</name>
              <description>Write Protection 0: Specific STCU2 registers can be written through IPS bus interface 1: STCU2 registers cannot be written through IPS, preventing any user application write operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LB_DELAY</name>
              <description>Delay LBIST run LB_DELAY defines the delay between the LBIST starts when more than a single LBIST is selected to be executed concurrently with the purpose of smoothing the power consumption transient</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTR</name>
              <description>First LBIST or MBIST pointer PTR defines the logical pointer to the first LBIST or MBIST to be scheduled when the self-testing procedure is enabled</description>
              <bitOffset>21</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDG</name>
          <description>STCU2 Watchdog Granularity</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDGEOC</name>
              <description>Watchdog End of Count Timer This value has to be set to define the time budget related to the online self-test execution and check that everything is correctly working within this slot of time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_STAT</name>
          <description>STCU2 Error</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFSF</name>
              <description>Recoverable Faults Status Flag This flag reports the global status of the Recoverable Fault (RF)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No errors that trigger the Recoverable Faults condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>There are errors that trigger the Recoverable Faults condition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UFSF</name>
              <description>Unrecoverable Faults Status Flag This flag reports the global status of the Unrecoverable Faults(UF)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No errors that trigger the UF condition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>There are errors that trigger the UF condition.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVPSW</name>
              <description>Online invalid pointer You can always read this field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid linked pointer list</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Invalid linked pointer list. The following conditions set this bit: Initial LBIST orMBIST pointer is out of range; LBIST is selected when MBIST is concurrently running or vice versa; Error in the LBIST/MBIST linking (execution generates an infinite loop).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENGESW</name>
              <description>Online engine error You can always read this field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid engine execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Invalid engine execution. The error conditions that set this bit are FSM, protocol error, and so on.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTOSW</name>
              <description>Online watchdog timeout You can always read this field</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPLETED</name>
                  <description>LBIST and MBIST time slots completed within the assigned watchdog time.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_COMPLETED</name>
                  <description>LBIST and MBIST time slots not completed within the assigned watchdog time or there are internal mismatches among End of Execution signals.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKESW</name>
              <description>Online LOCK error You can always read this field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>In case PLL is enabled, it is correctly locked during the self-test sequence</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>When the PLL is enabled, this flag highlights that there has been an unexpected PLL unlock(loss-of-lock) event during the online self-test sequence execution. The online self-test run is stopped and the status of the currently running LBISTs or MBISTs is saved in the related registers. The LOCK signal is monitored during the LBIST run when RUNSW[LBSWPLLEN] is set and/or during the MBIST run when RUNSW[MBSWPLLEN] = 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_FM</name>
          <description>STCU2 Error FM</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INVPUFM</name>
              <description>Invalid Pointer Unrecoverable Fault Mapping</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable Fault Mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable Mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENGEUFM</name>
              <description>Engine Error Unrecoverable Fault Mapping</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable Fault Mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable Fault Mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTOUFM</name>
              <description>Watchdog Timeout Unrecoverable Fault Mapping</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable Fault Mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable Fault Mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKEUFM</name>
              <description>PLL LOCK Unrecoverable Fault Mapping</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable Fault Mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable Fault Mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LBSSW0</name>
          <description>STCU2 Online LBIST Status</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LBSSW0</name>
              <description>LBSSW0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed LBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUCCESS</name>
                  <description>Successful LBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LBESW0</name>
          <description>STCU2 Online LBIST End Flag</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LBESW0</name>
              <description>LBESW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCOMPLETE</name>
                  <description>LBIST execution not yet completed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPLETE</name>
                  <description>LBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LBUFM0</name>
          <description>STCU2 Online LBIST Unrecoverable FM</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LBUFM0</name>
              <description>LBIST Unrecoverable Fault Mapping</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable Fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable Fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
