linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>MBSSW0</name>
          <description>STCU2 Online MBIST Status</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBSSW0</name>
              <description>MBSSW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW1</name>
              <description>MBSSW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW2</name>
              <description>MBSSW</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW3</name>
              <description>MBSSW</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW4</name>
              <description>MBSSW</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW5</name>
              <description>MBSSW</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW6</name>
              <description>MBSSW</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW7</name>
              <description>MBSSW</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW8</name>
              <description>MBSSW</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW9</name>
              <description>MBSSW</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW10</name>
              <description>MBSSW</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBSSW11</name>
              <description>MBSSW</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Failed MBIST execution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>No fault detected during the MBIST execution</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MBESW0</name>
          <description>STCU2 Online MBIST End Flag</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBESW0</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW1</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW2</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW3</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW4</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW5</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW6</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW7</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW8</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW9</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW10</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBESW11</name>
              <description>Online end status of MBISTn (where n = 11:0).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>MBIST execution still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINISHED</name>
                  <description>MBIST execution finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
