linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>Tx_65To127Octets_Packets_Good_Bad</name>
          <description>Transmit 65 To 127 Octet Packets Good Bad</description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX65_127OCTGB</name>
              <description>Transmit 65 To 127 Octet Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_128To255Octets_Packets_Good_Bad</name>
          <description>Transmit 128 To 255 Octet Packets Good Bad</description>
          <addressOffset>0x72C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX128_255OCTGB</name>
              <description>Transmit 128 To 255 Octet Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_256To511Octets_Packets_Good_Bad</name>
          <description>Transmit 256 To 511 Octet Packets Good Bad</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX256_511OCTGB</name>
              <description>Transmit 256 To 511 Octet Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_512To1023Octets_Packets_Good_Bad</name>
          <description>Transmit 512 To 1023 Octet Packets Good Bad</description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX512_1023OCTGB</name>
              <description>Transmit 512 To 1023 Octet Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_1024ToMaxOctets_Packets_Good_Bad</name>
          <description>Transmit 1024 To Max Octet Packets Good Bad</description>
          <addressOffset>0x738</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX1024_MAXOCTGB</name>
              <description>Transmit 1024 To Max Octet Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Unicast_Packets_Good_Bad</name>
          <description>Transmit Unicast Packets Good Bad</description>
          <addressOffset>0x73C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXUCASTGB</name>
              <description>Transmit Unicast Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Multicast_Packets_Good_Bad</name>
          <description>Transmit Multicast Packets Good Bad</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXMCASTGB</name>
              <description>Transmit Multicast Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Broadcast_Packets_Good_Bad</name>
          <description>Transmit Broadcast Packets Good Bad</description>
          <addressOffset>0x744</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXBCASTGB</name>
              <description>Transmit Broadcast Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Underflow_Error_Packets</name>
          <description>Transmit Underflow Error Packets</description>
          <addressOffset>0x748</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXUNDRFLW</name>
              <description>Transmit Underflow Error Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Single_Collision_Good_Packets</name>
          <description>Transmit Single Collision Good Packets</description>
          <addressOffset>0x74C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXSNGLCOLG</name>
              <description>Transmit Single Collision Good Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Multiple_Collision_Good_Packets</name>
          <description>Transmit Multiple Collision Good Packets</description>
          <addressOffset>0x750</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXMULTCOLG</name>
              <description>Transmit Multiple Collision Good Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Deferred_Packets</name>
          <description>Transmit Deferred Packets</description>
          <addressOffset>0x754</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDEFRD</name>
              <description>Transmit Deferred Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Late_Collision_Packets</name>
          <description>Transmit Late Collision Packets</description>
          <addressOffset>0x758</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXLATECOL</name>
              <description>Transmit Late Collision Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Excessive_Collision_Packets</name>
          <description>Transmit Excessive Collision Packets</description>
          <addressOffset>0x75C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXEXSCOL</name>
              <description>Transmit Excessive Collision Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Carrier_Error_Packets</name>
          <description>Transmit Carrier Error Packets</description>
          <addressOffset>0x760</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXCARR</name>
              <description>Transmit Carrier Error Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Octet_Count_Good</name>
          <description>Transmit Octet Count Good</description>
          <addressOffset>0x764</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXOCTG</name>
              <description>Transmit Octet Count Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Packet_Count_Good</name>
          <description>Transmit Packet Count Good</description>
          <addressOffset>0x768</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXPKTG</name>
              <description>Transmit Packet Count Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Excessive_Deferral_Error</name>
          <description>Transmit Excessive Deferral Error</description>
          <addressOffset>0x76C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXEXSDEF</name>
              <description>Transmit Excessive Deferral Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_Pause_Packets</name>
          <description>Transmit Pause Packets</description>
          <addressOffset>0x770</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXPAUSE</name>
              <description>Transmit Pause Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_VLAN_Packets_Good</name>
          <description>Transmit VLAN Packets Good</description>
          <addressOffset>0x774</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXVLANG</name>
              <description>Transmit VLAN Packets Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Tx_OSize_Packets_Good</name>
          <description>Transmit O Size Packets Good</description>
          <addressOffset>0x778</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXOSIZG</name>
              <description>Transmit O Size Packets Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Packets_Count_Good_Bad</name>
          <description>Receive Packets Count Good Bad</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXPKTGB</name>
              <description>Receive Packets Count Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Octet_Count_Good_Bad</name>
          <description>Receive Octet Count Good Bad</description>
          <addressOffset>0x784</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXOCTGB</name>
              <description>Receive Octet Count Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Octet_Count_Good</name>
          <description>Receive Octet Count Good</description>
          <addressOffset>0x788</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXOCTG</name>
              <description>Receive Octet Count Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Broadcast_Packets_Good</name>
          <description>Receive Broadcast Packets Good</description>
          <addressOffset>0x78C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXBCASTG</name>
              <description>Receive Broadcast Packets Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Multicast_Packets_Good</name>
          <description>Receive Multicast Packets Good</description>
          <addressOffset>0x790</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXMCASTG</name>
              <description>Receive Multicast Packets Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_CRC_Error_Packets</name>
          <description>Receive CRC Error Packets</description>
          <addressOffset>0x794</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXCRCERR</name>
              <description>Receive CRC Error Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Alignment_Error_Packets</name>
          <description>Receive Alignment Error Packets</description>
          <addressOffset>0x798</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXALGNERR</name>
              <description>Receive Alignment Error Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Runt_Error_Packets</name>
          <description>Receive Runt Error Packets</description>
          <addressOffset>0x79C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXRUNTERR</name>
              <description>Receive Runt Error Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Jabber_Error_Packets</name>
          <description>Receive Jabber Error Packets</description>
          <addressOffset>0x7A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXJABERR</name>
              <description>Receive Jabber Error Packets</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Undersize_Packets_Good</name>
          <description>Receive Undersize Packets Good</description>
          <addressOffset>0x7A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXUNDERSZG</name>
              <description>Receive Undersize Packets Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_Oversize_Packets_Good</name>
          <description>Receive Oversize Packets Good</description>
          <addressOffset>0x7A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXOVERSZG</name>
              <description>Receive Oversize Packets Good</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_64Octets_Packets_Good_Bad</name>
          <description>Receive 64 Octets Packets Good Bad</description>
          <addressOffset>0x7AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX64OCTGB</name>
              <description>Receive 64 Octets Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_65To127Octets_Packets_Good_Bad</name>
          <description>Receive 65-127 Octets Packets Good Bad</description>
          <addressOffset>0x7B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX65_127OCTGB</name>
              <description>Receive 65-127 Octets Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_128To255Octets_Packets_Good_Bad</name>
          <description>Receive 128-255 Octets Packets Good Bad</description>
          <addressOffset>0x7B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX128_255OCTGB</name>
              <description>Receive 128-255 Octets Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Rx_256To511Octets_Packets_Good_Bad</name>
          <description>Receive 256-511 Octets Packets Good Bad</description>
          <addressOffset>0x7B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX256_511OCTGB</name>
              <description>Receive 256-511 Octets Packets Good Bad</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
