linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>SFB2AD</name>
          <description>Serial Flash Memory B2 Top Address Register</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x70000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPADB2</name>
              <description>Top address for serial flash memory B2.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RBDR[%s]</name>
          <description>RX Buffer Data Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>RX data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUTKEY</name>
          <description>LUT Key Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5AF05AF0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key to lock or unlock the LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKCR</name>
          <description>LUT Lock Configuration Register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>Unlock LUT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT0</name>
          <description>LUT Register</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8180403</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPRND0</name>
              <description>Operand for INSTR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD0</name>
              <description>Pad information for INSTR0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR0</name>
              <description>Instruction 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPRND1</name>
              <description>Operand for INSTR1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD1</name>
              <description>Pad information for INSTR1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR1</name>
              <description>Instruction 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT1</name>
          <description>LUT Register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x24001C08</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPRND0</name>
              <description>Operand for INSTR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD0</name>
              <description>Pad information for INSTR0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR0</name>
              <description>Instruction 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPRND1</name>
              <description>Operand for INSTR1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD1</name>
              <description>Pad information for INSTR1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR1</name>
              <description>Instruction 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT2</name>
          <description>LUT Register</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPRND0</name>
              <description>Operand for INSTR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD0</name>
              <description>Pad information for INSTR0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR0</name>
              <description>Instruction 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPRND1</name>
              <description>Operand for INSTR1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD1</name>
              <description>Pad information for INSTR1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR1</name>
              <description>Instruction 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT3</name>
          <description>LUT Register</description>
          <addressOffset>0x31C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPRND0</name>
              <description>Operand for INSTR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD0</name>
              <description>Pad information for INSTR0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR0</name>
              <description>Instruction 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPRND1</name>
              <description>Operand for INSTR1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD1</name>
              <description>Pad information for INSTR1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR1</name>
              <description>Instruction 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT4</name>
          <description>LUT Register</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPRND0</name>
              <description>Operand for INSTR0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD0</name>
              <description>Pad information for INSTR0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR0</name>
              <description>Instruction 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPRND1</name>
              <description>Operand for INSTR1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD1</name>
              <description>Pad information for INSTR1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>1 Pad</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>2 Pads</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>4 Pads</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>NA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTR1</name>
              <description>Instruction 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
