linzhi813/ems_s32k/config/S32K344.svd
        <register>
          <name>LMEM_DESC_1</name>
          <description>Local Memory Descriptor 1</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x86042000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MT</name>
              <description>Memory Type</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM</name>
                  <description>ITCM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTCM</name>
                  <description>DTCM</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ICACHE</name>
                  <description>ICACHE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCACHE</name>
                  <description>DCACHE</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPW</name>
              <description>Data Path Width</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIDE_32</name>
                  <description>LMEMn is 32-bits wide</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDE_64</name>
                  <description>LMEMn is 64-bits wide</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WY</name>
              <description>Level 1 Cache Ways</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WY_0</name>
                  <description>No cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_2</name>
                  <description>2-way set associative</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_4</name>
                  <description>4-way set associative</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZ</name>
              <description>Local Memory Size</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LMSZ_0</name>
                  <description>0 KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_1</name>
                  <description>1 KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_2</name>
                  <description>2 KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_3</name>
                  <description>4 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_4</name>
                  <description>8 KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_5</name>
                  <description>16 KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_6</name>
                  <description>32 KB</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_7</name>
                  <description>64 KB</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_8</name>
                  <description>128 KB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_9</name>
                  <description>256 KB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_10</name>
                  <description>512 KB</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_11</name>
                  <description>1024 KB</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_12</name>
                  <description>2048 KB</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_13</name>
                  <description>4096 KB</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_14</name>
                  <description>8192 KB</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_15</name>
                  <description>16384 KB</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZH</name>
              <description>LMEM Size Hole</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_OF_2</name>
                  <description>LMEMn is a power-of-2 capacity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_PWR_OF_2</name>
                  <description>LMEMn is not a power-of-2, with capacity of 0.75 x LMSZ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMV</name>
              <description>Local Memory Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PRESENT</name>
                  <description>LMEMn not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESENT</name>
                  <description>LMEMn present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LMEM_DESC_2</name>
          <description>Local Memory Descriptor 2</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x86042000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MT</name>
              <description>Memory Type</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM</name>
                  <description>ITCM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTCM</name>
                  <description>DTCM</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ICACHE</name>
                  <description>ICACHE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCACHE</name>
                  <description>DCACHE</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPW</name>
              <description>Data Path Width</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WIDE_32</name>
                  <description>LMEMn is 32-bits wide</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WIDE_64</name>
                  <description>LMEMn is 64-bits wide</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WY</name>
              <description>Level 1 Cache Ways</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WY_0</name>
                  <description>No cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_2</name>
                  <description>2-way set associative</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_4</name>
                  <description>4-way set associative</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZ</name>
              <description>Local Memory Size</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LMSZ_0</name>
                  <description>0 KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_1</name>
                  <description>1 KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_2</name>
                  <description>2 KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_3</name>
                  <description>4 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_4</name>
                  <description>8 KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_5</name>
                  <description>16 KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_6</name>
                  <description>32 KB</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_7</name>
                  <description>64 KB</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_8</name>
                  <description>128 KB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_9</name>
                  <description>256 KB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_10</name>
                  <description>512 KB</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_11</name>
                  <description>1024 KB</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_12</name>
                  <description>2048 KB</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_13</name>
                  <description>4096 KB</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_14</name>
                  <description>8192 KB</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_15</name>
                  <description>16384 KB</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZH</name>
              <description>LMEM Size Hole</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_OF_2</name>
                  <description>LMEMn is a power-of-2 capacity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_PWR_OF_2</name>
                  <description>LMEMn is not a power-of-2, with capacity of 0.75 x LMSZ</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMV</name>
              <description>Local Memory Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PRESENT</name>
                  <description>LMEMn not present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESENT</name>
                  <description>LMEMn present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
